/////// IDD_RCS_SLAB_PMODE_DLG
IDC_GURSL_FRAME_MATERIAL                      = "Material"
IDC_GSLAB_CHECK_MATERIAL_LCON                 = "Light Weight Concrete"
IDC_GURSL_BTN_DGNLOAD                         = "..."
IDC_GURSL_CHECK_DLOAD_UUI                     = "Use User Input"
IDC_GURSL_RADIO_STYPE_1WAY                    = "1 Way Slab"
IDC_GURSL_RADIO_STYPE_2WAY                    = "2 Way Slab"
IDC_GURSL_CHECK_BB_B2                         = "Use B1"
IDC_GURSL_CHECK_BB_B4                         = "Use B3"
IDC_GURSL_DADIO_1WY_1                         = "1 Way Support"
IDC_GURSL_RADIO_BAR_TYA                       = "Type ""A"""
IDC_GURSL_RADIO_BAR_TYB                       = "Type ""B"""
IDC_GURSL_RADIO_BAR_TYC                       = "Type ""C"""
IDC_GURSL_FRAME_SC_2WAY                       = "Support Condition (2Way)"
IDC_GURSL_LABEL_MATERIAL_FCK                  = "Concrete"
IDC_GURSL_LABEL_MATERIAL_RB                   = "Rebar"
IDC_GURSL_FRAME_DESIGN_LOAD                   = "Design Load"
IDC_GURSL_LABEL_DLOAD_DL                      = "Dead Load"
IDC_GURSL_LABEL_DLOAD_LL                      = "Live Load"
IDC_GURSL_FRAME_DIMEMSION                     = "Dimension"
IDC_GURSL_LABEL_DIMENSION_SPX                 = "Span(x)"
IDC_GURSL_LABEL_DIMENSION_SPY                 = "Span(y)"
IDC_GURSL_LABEL_DIMENSION_THIC                = "Thickness"
IDC_GURSL_LABEL_DIMENSION_COVER               = "Cover"
IDC_GURSL_FRAME_SLAB_TYPE                     = "Slab Type"
IDC_GURSL_FRAME_ARRANGE                       = "Bar Arrangement type"
IDC_GURSL_FRAME_ARRANGE_X                     = "Bar Arrangement (Y Direction)"
IDC_GURSL_FRAME_ARRANGE_Y                     = "Bar Arrangement (X Direction)"
IDC_GURSL_FRAME_SC_1WAY                       = "Support Condition (1Way)"
IDC_GURSL_FRAME_BB                            = "Boundary Beams"
IDC_GURSL_LABEL_BB_B1                         = "B1"
IDC_GURSL_LABEL_BB_B2                         = "B2"
IDC_GURSL_LABEL_BB_B3                         = "B3"
IDC_GURSL_LABEL_BB_B4                         = "B4"
IDC_GURSL_FRAME_ARRANGE_ETC                   = "Calculation Result"
IDC_GURSL_CHECK_USE_CLEARSPAN                 = "Use clear span"
IDC_GURSL_FRAME_DEFLECTION                    = "Deflection conditions"
IDC_GURSL_LABEL_DEFLECTION_SHORT__L_P              = "Short-term"
IDC_GURSL_LABEL_DEFLECTION_LONG               = "Long-term"
IDC_GURSL_LABEL_DEFLECTION_DURATION1          = "Time-dependant factor"
IDC_GSLAB_RADIO_CRACK_DRY                     = "Dry"
IDC_GSLAB_RADIO_CRACK_ETC                     = "Etc"
IDC_GURSL_LABEL_DEFLECTION_DURATION2          = "(Months)"
IDC_GURSL_LABEL_DEFLECTION_DURATION2_IS       = "(Days)"
IDC_GSLAB_LABEL_MATERIAL_FACT                 = "Factor"
IDC_GSLAB_FRAME_CRACK                         = "Crack Condition"
IDS_GURSL_FAIL_REBAR_DATA_NOT_CHANGED         = "Rebar Data is not Changed"
IDS_GSLAB_RADIO_CRACK_MILD                    = "Mild or Moderate"
IDS_GSLAB_RADIO_CRACK_SEVERE                  = "Severe"

//IDD_RCS_SLAB_DESIGN_DLG
IDD_RCS_SLAB_DESIGN_DLG                       = "Design Result ( Slab )"
IDC_GSLAB_DESIGN_RESULT_TXT                   = "Select rebar to apply"

//IDD_RCS_URSL_SECT_DLG
IDC_GURSL_CHECK_MATERIAL_LCON                 = "Light Weight Concrete"
IDC_GURSL_FRAME_THICK                         = "Thickness"
IDC_GURSL_THICK_BTN_ADD                       = "Add"
IDC_GURSL_THICK_BTN_DEL                       = "Delete"
IDC_GURSL_THICK_BTN_INS                       = "Insert"
IDC_GURSL_CHK_SAME_COVER                      = "Use Same Cover"
IDC_GURSL_FRAME_REBAR                         = "Rebar"
IDC_GURSL_FRAME_SPACE                         = "Bar Spacing"
IDC_GURSL_SPACE_BTN_ADD                       = "Add"
IDC_GURSL_SPACE_BTN_DEL                       = "Delete"
IDC_GURSL_SPACE_BTN_INS                       = "Insert"
IDC_GURSL_RADIO_CRACK_DRY                     = "Dry"
IDC_GURSL_RADIO_CRACK_ETC                     = "Etc"
IDC_GURSL_LABEL_MATERIAL_FY                   = "Main Bar"
IDC_GURSL_LABEL_MAINBAR                       = "Main Bar"
IDC_GURSL_LABEL_REBAR                         = "No of Bars"
IDC_GURSL_LABEL_MATERIAL_FACT                 = "Factor"
IDC_GURSL_FRAME_CRACK                         = "Crack Condition"

//IDD_RCS_URSL_PMODE_DLG
IDC_GURSL_FRAME_RESULT                        = "Calculation Result"

/////// IDD_RCS_SLAB_RBAR_DLG
IDC_GURSL_LABEL_REBAR_INIBAR                  = "Initial Bar"
IDC_GURSL_LABEL_REBAR_ININO                   = "No. of Bars"

/////// IDD_RCS_BEAM_PMODE_DLG
IDC_GURBE_FRAME_MATERIAL                      = "Material"
IDC_GURBE_LABEL_MATERIAL_FCK                  = "Concrete"
IDC_GURBE_LABEL_MATERIAL_FY                   = "Main Bar"
IDC_GURBE_LABEL_MATERIAL_FYS                  = "Stirrup"
IDC_GURBE_CHECK_MATERIAL_LCON                 = "Light Weight Concrete"
IDC_GURBE_LABEL_MATERIAL_FACT                 = "Factor"
IDC_GURBE_FRAME_SECTION                       = "Section"
IDC_GURBE_LABEL_SECTION_B                     = "Width"
IDC_GURBE_LABEL_SECTION_H                     = "Height"
IDC_GURBE_LABEL_SECTION_CC_TOP                = "Cover (Top)"
IDC_GURBE_LABEL_SECTION_CC_BOT                = "Cover (Bot)"
IDC_GURBE_CHECK_USE_TOPCOVER                  = "Use Top Cover"
IDC_GURBE_FRAME_TYPE                          = "Type"
IDC_GURBE_RADIO_SINGLE                        = "Single Rebar"
IDC_GURBE_RADIO_DOUBLE                        = "Double Rebar"
IDC_GURBE_FRAME_SHAPE                         = "Shape"
IDC_GURBE_RADIO_RECT                          = "Rectangular"
IDC_GURBE_RADIO_TSHAPE                        = "T Shape"
IDC_GURBE_LABEL_SECTION_SLABTHK               = "Slab Thk."
IDC_GURBE_LABEL_SECTION_EFFWIDTH              = "Effect. Width"
IDC_GURBE_FRAME_SKINBAR                       = "Skin Bar"
IDC_GURBE_LABEL_SKINBAR_NO                    = "Skin Bar"
IDC_GURBE_CHECK_DISTRIBUTE                    = "Evenly distribute at side"
IDC_GURBE_CHECK_DEFLECTION                    = "Check Deflection"
IDC_GURBE_STC_DEFL_SET                        = "Deflection Condition"
IDC_GURBE_FRAME_SEISMIC_DESIGN                = "Seismic Design"
IDC_GURBE_CHECK_SEISMIC_PROVISIONS            = "Apply Special Provisions"
IDC_GURBE_RADIO_SPECIAL_MOMENT                = "SMF"
IDC_GURBE_RADIO_INTERMEDIATE_MOMENT           = "IMF"
IDC_GURBE_RADIO_ORDINARY_MOMENT               = "OMF"
IDC_GURBE_CHECK_SEISMIC_PILOTI_GUIDE          = "Apply Pilotis Guideline, MOLIT"
IDC_GURBE_FRAME_ARRANGE                       = "Rebar Arrangement"
IDC_GURBE_RADIO_ARRANGETYPE1                  = "Type-1 (All Section)"
IDC_GURBE_RADIO_ARRANGETYPE2                  = "Type-2 (Both End && Center)"
IDC_GURBE_RADIO_ARRANGETYPE3                  = "Type-3 (Each End && Center)"
IDC_GURBE_STRING_COMMAND                      = "Change Section Data :"
IDC_GURBE_CHECK_FORCE_ONLY                    = "Change Force Only"
IDC_GURBE_CHECK_DIFFER_REBAR                  = "Use Different Rebar at each layer."
IDC_GURBE_CHECK_TOPBOT_SAMEREBAR              = "Use Same Rebar at Top && Bottom."
IDC_GURBE_FRAME_SPLICE                        = "Spacing Limit of Main Rebar"
IDC_GURBE_RADIO_SPLICE000                     = "Do not splice"
IDC_GURBE_RADIO_SPLICE050                     = "50% Splice"
IDC_GURBE_RADIO_SPLICE100                     = "100% Splice"
IDC_GURBE_FRAME_CRACK                         = "Crack Condition"
IDC_GURBE_RADIO_CRACK_DRY                     = "Dry"
IDC_GURBE_RADIO_CRACK_ETC                     = "Etc"

/////// IDD_RCS_BEAM_MLIST_DLG
IDC_RCS_BTN_MAKE_DATA                         = "Make Data"
IDC_GURBE_LIST_CHK_REBAR                      = "Show rebar details"
IDS_RCS_MAKE_DATA_FIRST                       = "To edit data by Member List, Make data first"

/////// IDD_RCS_BEAM_SECT_DLG
IDC_GURBE_FRAME_FORCE                         = "Force"
IDC_GURBE_LABEL_FORCE_M                       = "Moment"
IDC_GURBE_LABEL_FORCE_S                       = "Shear"

/////// IDD_RCS_DEFL_DLG
IDD_RCS_DEFL_DLG                              = "Deflection Condition"
IDC_RCS_DEFL_FRM_MEMB                         = "Select Member"
IDC_RCS_DEFL_BTN_ALL                          = "All"
IDC_RCS_DEFL_BTN_NONE                         = "None"
IDC_RCS_DEFL_RDO_LINE_LOAD                    = "Use Line Load"
IDC_RCS_DEFL_RDO_MOMENT                       = "Use Moment"
IDC_RCS_DEFL_BTN_OK                           = "Apply"
IDC_RCS_DEFL_BTN_CANCEL                       = "Cancel"
IDC_RCS_DEFL_FRM_DESIGN_LOAD                  = "Design Load"
IDC_RCS_DEFL_LBL_SUSTAINED_LOAD               = "Sustained Load"
IDC_RCS_DEFL_LBL_SPAN                         = "Span"
IDC_RCS_DEFL_FRM_SUPPORT_CONDITION            = "Support Condition"
IDC_RCS_DEFL_FRM_CONDITION_FACTORS            = "Factors"
IDC_RCS_DEFL_LBL_SHORT_TERM                   = "Short-term"
IDC_RCS_DEFL_STC_SHORT_TERM                   = "L /"
IDC_RCS_DEFL_LBL_LONG_TERM                    = "Long-term"
IDC_RCS_DEFL_STC_LONG_TERM                    = "L /"
IDC_RCS_DEFL_LBL_TIME_FACTOR                  = "Time-dependent Factor"
IDC_RCS_DEFL_STC_TIME_FACTOR                  = "( Months )"
IDC_RCS_DEFL_FRM_CONDITION_SPAN               = "Span"

/////// IDD_RCS_DEFL_LOAD_LINE_DLG
IDC_RCS_DEFL_LBL_DEAD_LOAD                    = "Dead Load"
IDC_RCS_DEFL_LBL_LIVE_LOAD                    = "Live Load"
IDC_RCS_DEFL_FRM_DGN_LOAD                     = "Design Load"

/////// IDD_RCS_DEFL_LOAD_MOME_DLG
IDC_RCS_DEFL_LBL_MDI                          = "M ( i )"
IDC_RCS_DEFL_LBL_MLI                          = "M ( i )"
IDC_RCS_DEFL_LBL_MDM                          = "M ( m )"
IDC_RCS_DEFL_LBL_MLM                          = "M ( m )"
IDC_RCS_DEFL_LBL_MDJ                          = "M ( j )"
IDC_RCS_DEFL_LBL_MLJ                          = "M ( j )"
IDC_RCS_DEFL_FRM_DEAD                         = "Dead Load"
IDC_RCS_DEFL_FRM_LIVE                         = "Live Load"

////// IDD_RCS_COMBINED_FOOTING_DEF_COLM_DLG
IDD_RCS_COMBINED_FOOTING_DEF_COLM_DLG         = "Define Column Data"
IDC_GUCBF_COLM_DATA_GRP                       = "Column Data"
IDC_GUCBF_COLM_DATA_ADD_BTN                   = "Add"
IDC_GUCBF_COLM_DATA_DEL_BTN                   = "Delete"
IDC_GUCBF_COLM_DATA_INS_BTN                   = "Insert"

////// IDD_RCS_COMBINED_FOOTING_INPUT_DLG
IDC_GUCBF_MATL_GRP                            = "Material"
IDC_GUCBF_MATL_FCK_STC                        = "Concrete"
IDC_GUCBF_MATL_MB_STC                         = "Main Bar"
IDC_GUCBF_MATL_LCON_CHK                       = "Light Weight Concrete"
IDC_GUCBF_MATL_FACT_STC                       = "Factor"
IDC_GUCBF_DESIGN_LOAD_GRP                     = "Design Load"
IDC_GUCBF_DLOAD_SW_CHK                        = "Include Self-Weight"
IDC_GUCBF_SURCHARGE_LOAD_STC                  = "Surcharge Load"
IDC_GUCBF_FOOTING_GRP                         = "Footing"
IDC_GUCBF_FOOTING_SPREAD_RDO                  = "Spread"
IDC_GUCBF_FOOTING_PILE_RDO                    = "Pile"
IDC_GUCBF_FOOTING_DEPTH_STC                   = "Depth"
IDC_GUCBF_FOOTING_COVER_STC                   = "Cover"
IDC_GUCBF_COLM_GRP                            = "Column"
IDC_GUCBF_SEL_COLM_GRP                        = "Select Column"
IDC_GUCBF_SEL_COLM_ALL_BTN                    = "All"
IDC_GUCBF_SEL_COLM_NONE_BTN                   = "None"
IDC_GUCBF_SEL_COLM_INVERT_BTN                 = "Invert"
IDC_GUCBF_SEL_COLM_DATA_BTN                   = "Column Data"
IDC_GUCBF_SECT_GRP                            = "Section"
IDC_GUCBF_SECT_RECT_RDO                       = "Rectangle"
IDC_GUCBF_SECT_CIRC_RDO                       = "Circle"
IDC_GUCBF_FORCE_GRP                           = "Force"
IDC_GUCBF_LCOM_BTN                            = "Load Combinations..."
IDC_GUCBF_IMPORT_DXF_BTN                      = "Import AutoCAD File..."
IDC_GUCBF_REBAR_GRP                           = "Bar Arrangement"
IDC_GUCBF_POSITION_FOOTING_RDO                = "Footing"
IDC_GUCBF_POSITION_COLUMN_RDO                 = "Column"
IDC_GUCBF_POSITION_PILE_RDO                   = "Pile"
IDC_GUCBF_POSITION_GRP                        = "Position Information"
IDC_GUCBF_PROPERTY_GRP                        = "Property"
IDC_GUCBF_RESULT_GRP                          = "Calculation Result"
IDC_GUCBF_INPUT_BTN_DESIGN                    = "Design"
IDC_GUCBF_INPUT_BTN_CHECK                     = "Check"
IDC_GUCBF_INPUT_BTN_REPORT                    = "Report ..."
IDC_GUCBF_INPUT_BTN_APPLY                     = "Apply"

////// IDD_RCS_COMBINED_FOOTING_LIST_DLG
IDC_GUCBF_LIST_TYPE_STC                       = "Type"
IDC_GUCBF_LIST_SPREAD_RDO                     = "Spread"
IDC_GUCBF_LIST_PILE_RDO                       = "Pile"

////// IDD_RCS_COMBINED_FOOTING_SMODE_REBAR_DLG
IDC_GUCBF_RBAR_GRP                            = "Rebar"
IDC_GUCBF_RBAR_INIT_X_STC                     = "Initial Bar (X)"
IDC_GUCBF_RBAR_INIT_Y_STC                     = "Initial Bar (Y)"
IDC_GUCBF_POSITION_BTN                        = "Position Information..."

////// IDD_RCS_COMBINED_FOOTING_SMODE_SECT_DLG
IDC_GUCBF_SECT_CX_STC                         = "Diameter"

////// IDD_RCS_COMBINED_FOOTING_SURCHARGE_DLG
IDC_GUCBF_SURCHARGE_LOAD_GRP                  = "Surcharge Load"
IDC_GUCBF_SLOAD_WD_STC                        = "Weight Density"
IDC_GUCBF_SLOAD_H_STC                         = "Height"

////// IDD_RCS_STRIPFOOT_INPUT_DLG
IDC_GURSF_FRM_MATERIAL                        = "Material"
IDC_GURSF_LABEL_MATERIAL_FCK                  = "Concrete"
IDC_GURSF_LABEL_MATERIAL_FY                   = "Main Bar"
IDC_GURSF_LABEL_MATERIAL_FYS                  = "Stirrup"
IDC_GURSF_LABEL_MATERIAL_FYS3                 = "Transv. Bar"
IDC_GURSF_FRM_SECTION                         = "Section"
IDC_GURSF_LBL_SECTION_SHAPE                   = "Shape"
IDC_GURSF_LBL_SECTION_H                       = "Height"
IDC_GURSF_LBL_SECTION_B                       = "Width"
IDC_GURSF_LBL_SECTION_B2                      = "Width 2"
IDC_GURSF_LBL_SECTION_WEB                     = "Web"
IDC_GURSF_LBL_SECTION_FLG                     = "Flange"
IDC_GURSF_LBL_SECTION_CC_TOP                  = "Cover (Top)"
IDC_GURSF_LBL_SECTION_CC_BOT                  = "Cover (Bot)"
IDC_GURSF_CHK_USE_BOTCOVER                    = "Use Bottom Cover"
IDC_GURSF_FRM_TYPE                            = "Type"
IDC_GURSF_RADIO_SINGLE                        = "Single Rebar"
IDC_GURSF_RADIO_DOUBLE                        = "Double Rebar"
IDC_GURSF_FRM_SOIL                            = "Soil Bearing"
IDC_GURSF_LBL_SOIL_BEAR                       = "Soil Capa."
IDC_GURSF_FRM_SPLICE                          = "Spacing Limit of Main Rebar"
IDC_GURSF_RDO_SPLICE000                       = "Do not splice"
IDC_GURSF_RDO_SPLICE050                       = "50% Splice"
IDC_GURSF_RDO_SPLICE100                       = "100% Splice"
IDC_GURSF_FRM_ARRANGE                         = "Rebar Arrangement"
IDC_GURSF_RADIO_ARRANGETYPE1                  = "Type-1 (All Section)"
IDC_GURSF_RADIO_ARRANGETYPE2                  = "Type-2 (Both End && Center)"
IDC_GURSF_RADIO_ARRANGETYPE3                  = "Type-3 (Each End && Center)"
IDC_GURSF_STRING_COMMAND                      = "Change Section Data :"
IDC_GURSF_BTN_COMMAND_MAX                     = "max( i,m,j )"
IDC_GURSF_BTN_COMMAND_MAX_IJ                  = "max( i,j )"
IDC_GURSF_BTN_COMMAND_SWITCH                  = "i <-> j"
IDC_GURSF_CHECK_FORCE_ONLY                    = "Change Force Only"
IDC_GURSF_CHECK_DIFFER_REBAR                  = "Use Different Rebar at each layer."
IDC_GURSF_CHECK_TOPBOT_SAMEREBAR              = "Use Same Rebar at Top && Bottom."
IDC_GURSF_CHECK_SHOW_LCB                      = "Show Load Combinations"

////// IDD_RCS_STRIPFOOT_LIST_DLG
IDC_GURSF_LIST_CHK_REBAR                      = "Show rebar details"

////// IDD_RCS_STRIPFOOT_SMODE_INPUT_SECT_DLG
IDC_GURSF_FRAME_FORCE                         = "Froce"
IDC_GURSF_LABEL_FORCE_M                       = "Moment"
IDC_GURSF_LABEL_FORCE_S                       = "Shear"
IDC_GURSF_FRAME_SOIL                          = "Soil Reaction / Bearing"
IDC_GURSF_LABEL_SOIL_FORC                     = "Reaction"
IDC_GURSF_LABEL_SOIL_BEAR                     = "Soil Capa."

////// IDD_URCF_COLM_DLG
IDD_URCF_COLM_DLG                             = "Column Detail Information"
IDC_GURCF_COLM_SECT_GRP                       = "Column Section"
IDC_GURCF_COLM_SECT_SHAPE_RECT                = "Rectangle"
IDC_GURCF_COLM_SECT_SHAPE_CIR                 = "Circle"
IDC_GURCF_COLM_SECT_Cx_TEXT                   = "Cx"
IDC_GURCF_COLM_SECT_Cy_TEXT                   = "Cy"
IDC_GURCF_COLM_LOAD_SERV                      = "Service Load"
IDC_GURCF_COLM_LOAD_Ps_TEXT                   = "Ps"
IDC_GURCF_COLM_LOAD_SERV_LCOM_BTN             = "Load Combinations ..."
IDC_GURCF_COLM_LOAD_FACT                      = "Factored Load"
IDC_GURCF_COLM_LOAD_FACT_LCOM_BTN             = "Load Combinations ..."
IDC_BTN_CHECK_LCOM_NUMB                       = "Check Load Combinations"
IDC_LCOM_NUMB_DOES_MATCH                      = "The number of load combinations does match."
IDC_LCOM_NUMB_DOES_NOT_MATCH                  = "The number of load combinations does not match."

////// IDD_URCF_PMODE_DLG
IDC_GURCF_MATL_GRP                            = "Material"
IDC_GURCF_MATL_FCK_STC                        = "Concrete"
IDC_GURCF_MATL_MB_STC                         = "Main Bar"
IDC_GURCF_MATL_LCON_CHK                       = "Light Weight Concrete"
IDC_GURCF_MATL_FACT_STC                       = "Factor"
IDC_GURCF_COLM_GRP                            = "Column Information"
IDC_GURCF_COLM_ADD_BTN                        = "Add"
IDC_GURCF_COLM_DEL_BTN                        = "Delete"
IDC_GURCF_FOOTING_GRP                         = "Footing"
IDC_GURCF_FOOTING_DEPTH_STC                   = "Depth"
IDC_GURCF_FOOTING_COVER_STC                   = "Cover"
IDC_GURCF_PROPERTY_GRP                        = "Footing Size"
IDC_GURCF_DESIGN_LOAD_GRP                     = "Design Load"
IDC_GURCF_LABEL_SLOAD_SL                      = "Surface Load"
IDC_GURCF_LABEL_SLOAD_WD                      = "Weight Density"
IDC_GURCF_LABEL_SLOAD_H                       = "Height"
IDC_GURCF_DLOAD_SW_CHK                        = "Include Self-Weight"
IDC_GURCF_FRAME_PREVIEW                       = "Preview (Section && Diagram)"
IDC_GURCF_LABEL_PREVIEW_ITEM                  = "Item to Display"
IDC_GURCF_LABEL_TXTSIZE                       = "Text Size"
IDC_GURCF_REBAR_INFO_CHK                      = "Rebar Info."
IDC_GURCF_DIMENSION_CHK                       = "Dimension"
IDC_GURCF_COLM_NAME_CHK                       = "Column Name"
IDC_GURCF_VALUE_CHK                           = "Value"
IDC_GURCF_REBAR_X_DIR_GRP                     = "Bar Arrangement ( X-Dir. )"
IDC_GURCF_REBAR_X_DIR_SEL_STC                 = "Rebar Position :"
IDC_GURCF_REBAR_Y_DIR_GRP                     = "Bar Arrangement ( Y-Dir. )"
IDC_GURCF_REBAR_Y_DIR_SEL_STC                 = "Rebar Position :"
IDC_GURCF_RESULT_GRP                          = "Calculation Result"
IDC_GURCF_INPUT_BTN_DESIGN                    = "Design"
IDC_GURCF_INPUT_BTN_CHECK                     = "Check"
IDC_GURCF_INPUT_BTN_REPORT                    = "Report ..."
IDC_GURCF_INPUT_BTN_APPLY                     = "Apply"
IDC_GURCF_SURCHARGE_CHK                       = "Include Surcharge Load"

////// IDD_URCF_MLIST_COLM_DLG
IDD_URCF_MLIST_COLM_DLG                       = "Column Info."
IDC_GURCF_LIST_COLM_TEXT                      = "Detail Information"
IDC_GURCF_LIST_COLM_ADD                       = "Add"
IDC_GURCF_LIST_COLM_DEL                       = "Delete"

////// IDD_URCF_RBAR_INFO_DLG
IDD_URCF_RBAR_INFO_DLG                        = "Rebar Info."

////// IDD_URCF_RBAR_DLG
IDC_GURCF_FRAME_FOUNDATION                    = "Footing"
IDC_GURCF_LABEL_FD_THICKNESS                  = "Depth"
IDC_GURCF_LABEL_FD_COVER                      = "Cover"
IDC_GURCF_FRAME_PROPERTY                      = "Property"
IDC_GURCF_FRAME_RBAR                          = "Rebar"
IDC_GURCF_LABEL_RBAR_INIT_X                   = "Initial Bar (x)"
IDC_GURCF_LABEL_RBAR_INIT_Y                   = "Initial Bar (y)"
IDC_GURCF_LABEL_BAR_NO                        = "No. of Bars"

////// IDD_URCF_SECT_DLG
IDC_GURCF_FRAME_SURCHARGE_LOAD                = "Surcharge Load"

////// IDD_RCS_BATCHWALL_BUILD_DLG
IDD_RCS_BATCHWALL_BUILD_DLG                   = "Building Data Setting"
IDC_GURGW_BUILD_TEXT                          = "Building Data for Batch Wall"
IDC_GURGW_BUILD_STORY_TEXT                    = "Story Grouping"
IDC_GURGW_BUILD_CMB_FR_TEXT                   = "From"
IDC_GURGW_BUILD_CMB_TO_TEXT                   = "To"
IDC_GURGW_BUILD_CMB_INC_TEXT                  = "Increment"
IDC_GURGW_BUILD_BTN_SEL                       = "Select"
IDC_GURGW_BUILD_BTN_NON                       = "None"
IDC_GURGW_BUILD_BTN_APP                       = "OK"
IDC_GURGW_BUILD_BTN_CAN                       = "Cancel"

////// IDD_RCS_BATCH_COLM_BUILD_DLG
IDD_RCS_BATCH_COLM_BUILD_DLG                  = "Building Data Setting"
IDC_GURBC_FRM_BUILD_DATA                      = "Building Data for Batch Column"
IDC_GURBC_LBL_STORY_GROUP                     = "Story Grouping"
IDC_GURBC_LBL_STORY_FR                        = "From"
IDC_GURBC_LBL_STORY_TO                        = "To"
IDC_GURBC_LBL_STORY_IN                        = "Increment"
IDC_GURBC_BTN_SLCT                            = "Select"
IDC_GURBC_BTN_NONE                            = "None"
IDC_GURBC_BTN_OKOK                            = "OK"
IDC_GURBC_BTN_CNCL                            = "Cancel"

////// IDD_RCS_BATCH_BEAM_BUILD_DLG
IDD_RCS_BATCH_BEAM_BUILD_DLG                  = "Building Data Setting"
IDC_RCS_FRM_BUILD_DATA                        = "Building Data for Batch Beam"
IDC_RCS_LBL_STORY_GROUP                       = "Story Grouping"
IDC_RCS_LBL_STORY_FR                          = "From"
IDC_RCS_LBL_STORY_TO                          = "To"
IDC_RCS_LBL_STORY_IN                          = "Increment"
IDC_RCS_BTN_SLCT                              = "Select"
IDC_RCS_BTN_NONE                              = "None"
IDC_RCS_BTN_OKOK                              = "OK"
IDC_RCS_BTN_CNCL                              = "Cancel"

////// IDD_RCS_BATCH_WALL_BUILD_DLG
IDD_RCS_BATCH_WALL_BUILD_DLG                  = "Building Data Setting"
IDC_GURGW_FRM_BUILD_DATA                      = "Building Data for Batch Wall"
IDC_GURGW_LBL_STORY_GROUP                     = "Story Grouping"

////// IDD_RCS_BATCHWALL_INPUT_DLG
IDC_GURGW_FRAME_MAP                           = "Location Map"
IDC_GURGW_FRAME_WALLID                        = "Wall ID"
IDC_GURGW_INPUT_BTN_SMART_DESIGN_MEM          = "Smart Design Member"
IDC_GURGW_BTN_SMARTDGN                        = IDC_GURGW_INPUT_BTN_SMART_DESIGN_MEM
IDC_GURGW_FRAME_WALL                          = "Wall Data"
IDC_GURGW_LABEL_STORY_FR                      = "From"
IDC_GURGW_LABEL_STORY_TO                      = "To"
IDC_GURGW_LABEL_STORY_BY                      = "by"
IDC_GURGW_BTN_STORY_SEL                       = "Select"
IDC_GURGW_BTN_STORY_NON                       = "None"
IDC_GURGW_LABEL_NOTE                          = "Ctrl+Up/Dn to Copy"
IDC_GURGW_INPUT_BTN_APPLY                     = "Apply"
IDC_GURGW_INPUT_BTN_DESIGN                    = "Design"
IDC_GURGW_INPUT_BTN_CHECK                     = "Check"
IDC_GURGW_INPUT_BTN_REPORT                    = "Report ..."
IDC_GURGW_CHECK_SHOW_ENDBAR                   = "Show end rebar controls"
IDC_GURGW_CHECK_SHOW_SEISMIC                  = "Show seismic design controls"
IDC_GURGW_FRM_EDITOPT                         = "Edit Option"
IDC_GURGW_EDTOPT_CHK_MATLFCK                  = "Concrete"
IDC_GURGW_EDTOPT_CHK_MATLFYR                  = "Rebar"
IDC_GURGW_EDTOPT_CHK_SECTTHK                  = "Thickness"
IDC_GURGW_EDTOPT_CHK_SECTLEN                  = "Length"
IDC_GURGW_EDTOPT_CHK_SPECIAL                  = "Special Wall"
IDC_GURGW_EDTOPT_CHK_BOUNDARY                 = "Boundary Element"
IDC_GURGW_EDTOPT_CHK_PILOTIS                  = "Pilotis Design Guide"

////// IDD_URBB_SMART_DGN_OPTION_DLG
IDD_URBB_SMART_DGN_OPTION_DLG                 = "Smart Design Option ( Batch Beam )"

////// IDD_URBC_SMART_DGN_OPTION_DLG
IDD_URBC_SMART_DGN_OPTION_DLG                 = "Smart Design Option ( Batch Column )"
IDC_CHK_OPTN_STRY                             = "Apply Option by Story"
IDC_BTN_STORY_MOD                             = "Modify Option"
IDC_BTN_STORY_DEL                             = "Delete Option"

////// IDD_URBW_SMART_DGN_OPTION_DLG
IDD_URBW_SMART_DGN_OPTION_DLG                 = "Smart Design Option ( Batch Wall )"

////// IDD_RCS_BATCHWALL_OPTION_DLG
IDD_RCS_BATCHWALL_OPTION_DLG                  = "Smart Design Option"
IDC_GURGW_OPTION_DGN_SECT_CHK                 = "Change Section by Design"
IDC_GURGW_OPTION_DGN_SECT_D_CHK               = "Max. Thick"
IDC_GURGW_OPTION_DGN_GEN_CHK                  = "Use Design Method of Gen/ADS"
IDC_GURGW_OPTION_DGN_GEN_LABEL                = "Design Method"
IDC_GURGW_OPTION_DGN_GEN_LABEL2               = "No. of End Rebars"
IDC_GURGW_OPTION_ORD_TEXT                     = "Ordering Option"
IDC_GURGW_OPTION_ORD_RDO1                     = "Consider Rebar Area and Space"
IDC_GURGW_OPTION_ORD_RDO2                     = "Consider Rebar Area Only"
IDC_GURGW_OPTION_DGN_SPACE_CHK                = "Input Rebar Spacing"
IDC_GURGW_OPTION_FRM_VSPACE                   = "Vertical Rebar"
IDC_GURGW_OPTION_DGN_VSPACE_MIN_LABEL         = "Minimum"
IDC_GURGW_OPTION_DGN_VSPACE_MAX_LABEL         = "Maximum"
IDC_GURGW_OPTION_DGN_VSPACE_INC_LABEL         = "Increment"
IDC_GURGW_OPTION_FRM_HSPACE                   = "Horizontal Rebar"
IDC_GURGW_OPTION_DGN_HSPACE_MIN_LABEL         = "Minimum"
IDC_GURGW_OPTION_DGN_HSPACE_MAX_LABEL         = "Maximum"
IDC_GURGW_OPTION_DGN_HSPACE_INC_LABEL         = "Increment"
IDC_GURGW_OPTION_DGN_SPACE_EXP_LABEL          = "If ""Input Rebar Spacing"" option is not checked on, the spacing defined in ""Rebar Option"" will be applied."
IDC_GURGW_OPTION_CHK_MATL                     = "Material by Rebar Dia"
IDC_GURGW_OPTION_FRM_MATL_VBAR                = "Vertical / End Rebar"
IDC_GURGW_OPTION_BTN_ADD_VBAR                 = "Add"
IDC_GURGW_OPTION_BTN_INS_VBAR                 = "Insert"
IDC_GURGW_OPTION_BTN_DEL_VBAR                 = "Delete"
IDC_GURGW_OPTION_FRM_MATL_HBAR                = "Horizontal Rebar"
IDC_GURGW_OPTION_BTN_ADD_HBAR                 = "Add"
IDC_GURGW_OPTION_BTN_INS_HBAR                 = "Insert"
IDC_GURGW_OPTION_BTN_DEL_HBAR                 = "Delete"
IDC_GURGW_OPTION_CHK_VBAR                     = "Vertical Rebar by Story Height"
IDC_GURGW_OPTION_DGN_LBL_VBAR_H               = "If Story Height  >"
IDC_GURGW_OPTION_DGN_LBL_VBAR_N               = "Use Rebar"
IDC_GURGW_OPTION_BTN_DEFAULT                  = "Default"
IDC_GURGW_OPTION_BTN_APPLY                    = "OK"
IDC_GURGW_OPTION_BTN_CANCEL                   = "Cancel"

////// IDD_RCS_BATCHWALL_WALL_DLG
IDD_RCS_BATCHWALL_WALL_DLG                    = "Wall Infomation"
IDC_GURGW_WALL_ID                             = "Wall ID"
IDC_GURGW_WALL_BTN_APPLY                      = "Apply"
IDC_GURGW_WALL_BTN_CHECK                      = "Check"
IDC_GURGW_WALL_BTN_CLOSE                      = "Close"

/////// IDD_RCS_DESIGN_LOAD
IDD_RCS_DESIGN_LOAD                           = "Design Load"
IDC_RCS_DL_INFO_FRM_NAME                      = "Name"
IDC_RCS_DL_NAME_DEL_BTN                       = "Delete"
IDC_RCS_DL_INFO_CAL_ALL_BTN                   = "Calculate(All)"
IDC_RCS_DL_INFO_APPL_CHK                      = "Apply current load factor"
IDC_RCS_DL_INFO_FRM_LOAD                      = "Load Information"
IDC_RCS_DL_INFO_FRM_FACT                      = "Load Factor"
IDC_RCS_DL_INFO_CODE_BTN                      = "by Code"
IDC_RCS_DL_INFO_FRM_DEAD                      = "Dead Load"
IDC_RCS_DL_DEAD_ADD_BTN                       = "Add"
IDC_RCS_DL_DEAD_INS_BTN                       = "Insert"
IDC_RCS_DL_DEAD_DEL_BTN                       = "Delete"
IDC_RCS_DL_INFO_FRM_LIVE                      = "Live Load"
IDC_RCS_DL_INFO_FRM_DGNL                      = "Design Load"
IDC_RCS_DL_INFO_ADD_BTN                       = "Add"
IDC_RCS_DL_INFO_COP_BTN                       = "Copy"
IDC_RCS_DL_INFO_MOD_BTN                       = "Modify"
IDC_RCS_DL_INFO_CAL_BTN                       = "Calculate"
IDC_RCS_DL_INFO_LBL_NAME                      = "Name"
IDC_RCS_DL_INFO_LBL_DEAD                      = "Dead"
IDC_RCS_DL_INFO_LBL_LIVE                      = "Live"
IDC_RCS_DL_INFO_LBL_LIVE2                     = "Live"
IDC_RCS_DL_INFO_LBL_TYPE1                     = "Type1"
IDC_RCS_DL_INFO_LBL_TYPE2                     = "Type2"
IDC_RCS_DL_INFO_LBL_DGND                      = "Dead"
IDC_RCS_DL_INFO_LBL_SERV                      = "Service"
IDC_RCS_DL_INFO_LBL_DGNL                      = "Live"
IDC_RCS_DL_INFO_LBL_FACT                      = "Factor"

//RcsBeamlist_ExportDlg
IDC_GURBL_EXPORT_FRAME_LIST                   = "Beam Table"
IDC_GURBL_EXPORT_BTN_UPDATE                   = "Update Main Rebar"
IDC_GURBL_EXPORT_BTN_UPDATE_MBAR              = "Update Main Rebar"
IDC_GURBL_EXPORT_BTN_UPDATE_SBAR              = "Update Stirrup"
IDC_GURBL_EXPORT_BTN_CHEK                     = "Select"
IDC_GURBL_EXPORT_BTN_UNCHEKALL                = "UnSelect All"
IDC_GURBL_EXPORT_BTN_CHEKAll                  = "Select All"
IDC_GURBL_EXPORT_BTN_OK                       = "OK"
IDC_GURBL_EXPORT_BTN_CANCEL                   = "Cancle"
IDC_GURBL_EXPORT_STC_INFO                     = "Moment(φMn)"
IDC_MAIN_RBAR_STC                             = "Main Rebar"
IDC_MAIN_RBAR_STC_MBAR                        = "Main Rebar"
IDC_MAIN_RBAR_STC_SBAR                        = "Stirrup"
IDC_TARGET_RATIO_STC                          = "Target Ratio"
IDC_GURBL_EXPORT_STC_CURR_RBAR                = "Selected Rebar Info."

// RcsBeamlist_InputDlg
IDC_GURBL_FRAME_MATERIAL                      = "Material"
IDC_GURBL_CHECK_MATERIAL_LCON                 = "Light Weight Concrete"
IDC_GURBL_FRAME_SECTION                       = "Section"
IDC_GURBL_FRAME_REBAR                         = "Rebar"
IDC_GURBL_FRAME_LAYER                         = "Rebar no per layer"
IDC_GURBL_CHK_LAYER_AUTO                      = "Auto"
IDC_GURBL_FRAME_SPACE                         = "Space between layers"
IDC_GURBL_CHK_SPACE_AUTO                      = "Auto"
IDC_GURBL_FRAME_COMBAR                        = "Compression Rebar"
IDC_GURBL_RADIO_COMBAR_NONE                   = "Do not consider"
IDC_GURBL_RADIO_COMBAR_LAYER                  = "All of layer 1"
IDC_GURBL_RADIO_COMBAR_RATIO                  = "By ratio"
IDC_GURBL_FRAME_SPLICE                        = "Spacing Limit of Main Rebar"
IDC_GURBL_RADIO_SPLICE000                     = "Do not splice"
IDC_GURBL_RADIO_SPLICE050                     = "50% Splice"
IDC_GURBL_RADIO_SPLICE100                     = "100% Splice"
IDC_GURBL_RADIO_CRACK_DRY                     = "Dry"
IDC_GURBL_RADIO_CRACK_ETC                     = "Etc"
IDC_GURBL_FRAME_RESULT                        = "Calculation Result"
IDC_GURBL_LABEL_NAME                          = "Member Name"
IDC_GURBL_LABEL_MATERIAL_FCK                  = "Concrete"
IDC_GURBL_LABEL_MATERIAL_FY                   = "Main Bar"
IDC_GURBL_LABEL_MATERIAL_FYS                  = "Stirrup"
IDC_GURBL_LABEL_SECTION_B                     = "Width"
IDC_GURBL_LABEL_SECTION_H                     = "Height"
IDC_GURBL_LABEL_SECTION_CC                    = "Cover"
IDC_GURBL_LABEL_USE_TYPE                      = "Apply this member to "
IDC_GURBL_LABEL_MAINBAR                       = "Main Bar"
IDC_GURBL_LABEL_STIRRUP                       = "Stirrup"
IDC_GURBL_LABEL_LAYER                         = "No. of Layers"
IDC_GURBL_LABEL_LAYER_NO                      = "EA / Layer"
IDC_GURBL_LABEL_MATERIAL_FACT                 = "Factor"
IDC_GURBL_FRAME_CRACK                         = "Crack Condition"
IDC_GURBL_LABEL_RESULT_M                      = "Moment"
IDC_GURBL_LABEL_RESULT_V                      = "Shear"

// RcsShearWallForceDlg
IDC_RCS_WALL_FORCE_LABEL_NOTICE               = "LCB1 will be replaced by governing Load Comination after Check / Design."
IDC_RCS_WALL_FORCE_BTN_ADD                    = "&Add"
IDC_RCS_WALL_FORCE_BTN_INS                    = "&Insert"
IDC_RCS_WALL_FORCE_BTN_DEL                    = "&Delete"
IDC_RCS_WALL_FORCE_BTN_OK                     = "&OK"
IDC_RCS_WALL_FORCE_BTN_CANCEL                 = "&Cancel"

//RcsShearWallInputDlg
IDC_GURSW_FRAME_MATERIAL                      = "Material ( Basic )"
IDC_GURSW_LABEL_MATERIAL_FCK                  = "Concrete"
IDC_GURSW_LABEL_MATERIAL_MB                   = "Ver. Bar"
IDC_GURSW_LABEL_MATERIAL_HB                   = "Hor. Bar"
IDC_GURSW_FRAME_MATERIAL2                     = "Material ( Factor )"
IDC_GURSW_CHECK_MATERIAL_LCON                 = "Light Weight Concrete"
IDC_GURSW_LABEL_MATERIAL_FACT                 = "Factor"
IDC_GURSW_FRAME_DIMENSION                     = "Section"
IDC_GURSW_LABEL_SECTION_THICKNESS             = "Thickness"
IDC_GURSW_LABEL_SECTION_LENGTH                = "Length"
IDC_GURSW_LABEL_SECTION_COVER                 = "Cover"
IDC_GURSW_LABEL_SECTION_HEIGHT_X              = "Height(x)"
IDC_GURSW_LABEL_SECTION_HEIGHT_Y              = "Height(y)"
IDC_GURSW_LABEL_KFACTOR_X                     = "Kx"
IDC_GURSW_LABEL_KFACTOR_Y                     = "Ky"
IDC_GURSW_CHECK_WEAK_BENDING                  = "Check weak axis bending"
IDC_GURSW_FRAME_FORCE                         = "Axial Force && Moment"
IDC_GURSW_LABEL_FORCE_AXIAL                   = "Axial"
IDC_GURSW_LABEL_FORCE_MOMENT_X                = "Moment(x)"
IDC_GURSW_LABEL_FORCE_MOMENT_Y                = "Moment(y)"
IDC_GURSW_CHECK_APPLY2SHEAR                   = "Apply to shear check"
IDC_GURSW_FRAME_SHEAR                         = "Shear Force"
IDC_GURSW_LABEL_FORCE_SHEAR_Y                 = "Shear(y)"
IDC_GURSW_LABEL_FORCE_AXIAL_Y                 = "Axial(y)"
IDC_GURSW_LABEL_FORCE_MOMENT_X_SHEAR          = "Moment(x)"
IDC_GURSW_FRAME_FACTOR                        = "Factor"
IDC_GURSW_LABEL_FACTOR_CMX                    = "Cmx"
IDC_GURSW_LABEL_FACTOR_CMY                    = "Cmy"
IDC_GURSW_LABEL_FACTOR_BETAD                  = "βd"
IDC_GURSW_BTN_LCOMB                           = "Load Combinations ..."
IDC_GURSW_FRAME_ARRANGE                       = "Rebar Arrangement"
IDC_GURSW_FRAME_REBAR                         = "Rebar"
IDC_GURSW_FRAME_SEISMIC                       = "Seismic Design"
IDC_GURSW_CHECK_SEISMIC_SPECIAL               = "Apply Special Provisions"
IDC_GURSW_RADIO_SPECIAL_MOMENT                = "Special Wall"
IDC_GURSW_RADIO_INTERMEDIATE_MOMENT           = "Intermediate Wall"
IDC_GURSW_INPUT_BTN_SEISMIC                   = "Design Parameters..."
IDC_GURSW_FRAME_PM_CURVE                      = "PM Curve"
IDC_GURSW_LABEL_PMCURVE                       = "Select Axis to Draw :"
IDC_GURSW_RADIO_PMCURVE_X                     = "Major(X)"
IDC_GURSW_RADIO_PMCURVE_Y                     = "Minor(Y)"
IDC_GURSW_FRAME_CHECKITEM                     = "Calculation Result"

//RcsShearWallSeismicDlg
IDC_GURSW_SEISMIC_CHK_BELEM                   = "Boundary Element"
IDC_GURSW_SEISMIC_BTN_APPLY                   = "&Apply"
IDC_GURSW_SEISMIC_BTN_CLOSE                   = "&Close"
IDC_GURSW_SPECSIOAL_SHEAR_WALL                = "Special Structural Wall"
IDC_GURSW_SEISMIC_LBL_WALLH                   = "Total Height"
IDC_GURSW_SEISMIC_LBL_FORCE                   = "Pu"

//RcsShearWallSimpleInputRebarDlg
IDC_GURSW_FRAME_MAINBAR                       = "Rebar"
IDC_GURSW_LABEL_UNIT2                         = "Unit : "
IDC_GURSW_LABEL_UNIT                          = "Unit"
IDC_GURSW_LABEL_VERBAR_NO                     = "Ver. Bar"
IDC_GURSW_LABEL_HORBAR_NO                     = "Hor. Bar"
IDC_GURSW_LABEL_ENDBAR_NO                     = "End Bar"
IDC_GURSW_LABEL_BEBAR                         = "BE. Hor."

// RcsStairSimpleInputRBarDlg
IDC_GURST_LABEL_BAR_NAME                      = "Initial Rebar"
IDC_GURST_FRAME_REBAR                         = "Rebar"
IDC_GURST_LABEL_BAR_NO                        = "No. of Bars"
IDC_GURST_FRAME_PREVIEW                       = "Preview (Section && Diagram)"
IDC_GURST_LABEL_PREVIEW_ITEM                  = "Item to Display :"
IDC_GURST_TABLE_USE_LEFT                      = "Use Left"

// RcsStairSimpleInputSectDlg
IDC_GURST_CHECK_MATERIAL_LCON                 = "Light Weight Concrete"
IDC_GURST_RADIO_SUPPORT_BY_LANDING            = "by Landing"
IDC_GURST_RADIO_SUPPORT_BY_OTHERS             = "by Wall or Beam"
IDC_GURST_RADIO_CRACK_DRY                     = "Dry"
IDC_GURST_RADIO_CRACK_ETC                     = "Etc"
IDC_GURST_FRAME_MATERIAL                      = "Material"
IDC_GURST_LABEL_MATERIAL_FCK                  = "Concrete"
IDC_GURST_LABEL_MATERIAL_FY                   = "Main Bar"
IDC_GURST_LABEL_DL_STAIR                      = "D.L(Stair)"
IDC_GURST_LABEL_DL_LANDING                    = "D.L(Landing)"
IDC_GURST_LABEL_LIVE_LOAD                     = "Live Load"
IDC_GURST_FRAME_SUPPORT                       = "Support"
IDC_GURST_LABEL_SUPPORT_R                     = "Right"
IDC_GURST_LABEL_SUPPORT_L                     = "Left"
IDC_GURST_FRAME_THICK                         = "Thickness"
IDC_GURST_LABEL_THICK_STAIR                   = "Stair"
IDC_GURST_LABEL_THICK_LANDING                 = "Landing"
IDC_GURST_LABEL_THICK_COVER                   = "Cover"
IDC_GURST_FRAME_LENGTH                        = "Length"
IDC_GURST_LABEL_LENGTH_LANDING_L              = "Landing(L)"
IDC_GURST_LABEL_LENGTH_LANDING_R              = "Landing(R)"
IDC_GURST_LABEL_LENGTH_STAIR                  = "Stair"
IDC_GURST_FRAME_SIZE                          = "Size"
IDC_GURST_LABEL_SIZE_HEIGHT                   = "Height"
IDC_GURST_LABEL_SIZE_WIDTH                    = "Width"
IDC_GURST_LABEL_MATERIAL_FACT                 = "Factor"
IDC_GURST_FRAME_CRACK                         = "Crack Condition"

//RcsStair_InputDlg
IDC_GURST_CHECK_END_REBAR                     = "Use End Rebar"

/////// IDD_RCS_COLM_GEN_FORCE_DLG_EC
IDD_RCS_COLM_GEN_FORCE_DLG_EC                 = "Load Combinations"
IDC_RCS_COLGEN_FORCE_BTN_ALL                  = "&All"
IDC_RCS_COLGEN_FORCE_BTN_NON                  = "&None"
IDC_RCS_COLGEN_FORCE_BTN_INV                  = "&Invert"
IDC_RCS_COLGEN_FORCE_BTN_ADD                  = "&Add"
IDC_RCS_COLGEN_FORCE_BTN_INS                  = "&Insert"
IDC_RCS_COLGEN_FORCE_BTN_DEL                  = "&Delete"
IDC_RCS_COLGEN_FORCE_BTN_OK                   = "&OK"
IDC_RCS_COLGEN_FORCE_BTN_CANCEL               = "&Cancel"

/////// IDD_RCS_URGC_MATL_DLG
IDC_GURGC_FRAME_MATERIAL                      = "Material"
IDC_GURGC_LABEL_MATERIAL_FCK                  = "Concrete"
IDC_GURGC_LABEL_MATERIAL_MB                   = "Main Bar"
IDC_GURGC_LABEL_MATERIAL_HB                   = "Hoop Bar"
IDC_GURGC_CHECK_MATERIAL_LCON                 = "Light Weight Concrete"
IDC_GURGC_LABEL_MATERIAL_FACT                 = "Factor"
IDC_GURGC_FRAME_LENGTH                        = "Length"
IDC_GURGC_LABEL_LENGTH_X                      = "Length(x)"
IDC_GURGC_LABEL_LENGTH_Y                      = "Length(y)"
IDC_GURGC_LABEL_KFACTOR_X                     = "Kx"
IDC_GURGC_LABEL_KFACTOR_Y                     = "Ky"
IDC_GURGC_FRAME_SPLICE                        = "Spacing Limit of Main Rebar"
IDC_GURGC_RADIO_SPLICE000                     = "Do not splice"
IDC_GURGC_RADIO_SPLICE050                     = "50% Splice"
IDC_GURGC_RADIO_SPLICE100                     = "100% Splice"
IDC_GURGC_FRAME_EFF_AREA                      = "Equivalent Area for General Section"
IDC_GURGC_LABEL_EFF_AREA_B                    = "Width (B)"
IDC_GURGC_LABEL_EFF_AREA_H                    = "Height (D)"
IDC_GURGC_BTN_EFF_AREA_CALC                   = "Update Size"
IDC_GURGC_SLEN_IMPER_CHK                      = "Consider Effect of Imperfections"
IDC_GURGC_SLEN_2ND_CHK                        = "Consider 2nd Order Effects"
IDC_GURGC_SLEN_CHK_A                          = "Calc. by Program"
IDC_GURGC_SLEN_CHK_B                          = "Calc. by Program"
IDC_GURGC_SLEN_CHK_C                          = "Calc. by Program"

/////// IDD_RCS_URGC_FORC_DLG
IDC_GURGC_FRAME_COVER                         = "Cover"
IDC_GURGC_LABEL_COVER                         = "Cover"
IDC_GURGC_FRAME_HOOPBAR                       = "Hoop Bar"
IDC_GURGC_LABEL_UNIT2                         = "Unit : "
IDC_GURGC_LABEL_UNIT                          = "Unit"
IDC_GURGC_LABEL_HOOP_END                      = "End"
IDC_GURGC_LABEL_HOOP_CEN                      = "Center"
IDC_GURGC_CHECK_HOOP_USER                     = "Use User Input"
IDC_GURGC_FRAME_TIEBAR                        = "Tie Bar"
IDC_GURGC_CHECK_TIEBAR                        = "Apply to Shear Check"
IDC_GURGC_LABEL_TIEBAR_MATL                   = "Material"
IDC_GURGC_LABEL_TIEBAR_RBAR                   = "Rebar"
IDC_GURGC_LABEL_TIEBAR_NOX                    = "No.(x)"
IDC_GURGC_LABEL_TIEBAR_NOY                    = "No.(y)"
IDC_GURGC_FRAME_FORCE_FACTOR                  = "Force && Factor"
IDC_GURGC_FRAME_FORCE                         = "Axial Force && Moment"
IDC_GURGC_LABEL_FORCE_AXF                     = "Axial"
IDC_GURGC_LABEL_FORCE_MEMX                    = "Moment(x)"
IDC_GURGC_LABEL_FORCE_MEMY                    = "Moment(y)"
IDC_GURGC_FRAME_SHEAR                         = "Shear Force"
IDC_GURGC_LABEL_FORCE_AXIAL_X                 = "Axial(x)"
IDC_GURGC_LABEL_FORCE_SHX                     = "Shear(x)"
IDC_GURGC_LABEL_FORCE_AXIAL_Y                 = "Axial(y)"
IDC_GURGC_LABEL_FORCE_SHY                     = "Shear(y)"
IDC_GURGC_FRAME_COE                           = "Coefficient / Factor"
IDC_GURGC_LABEL_COE_CMX                       = "Cmx"
IDC_GURGC_LABEL_COE_CMY                       = "Cmy"
IDC_GURGC_LABEL_COE_BETAD                     = "βd"
IDC_GURGC_BTN_LCOMB                           = "Load Combinations ..."

/////// RcsGenColmInputSect2Dlg_EC
IDC_GURGC_CHECK_APPLY2SHEAR                   = "Apply to Shear Check"
IDC_GURGC_LABEL_FORCE_MEMXI                   = "Moment(xi)"
IDC_GURGC_LABEL_FORCE_MEMXJ                   = "Moment(xj)"
IDC_GURGC_LABEL_FORCE_MEMYI                   = "Moment(yi)"
IDC_GURGC_LABEL_FORCE_MEMYJ                   = "Moment(yj)"
IDC_GURGC_FRAME_COE_EC                        = "Effective Creep Ratio"
IDC_GURGC_CREEP_COEFFICIENT_STC               = "Ratio"

/////// IDD_RCS_URGC_RBAR_DLG
IDC_GURGC_FRAME_SECT_VIEW                     = "Section"
IDC_GURGC_BTN_SECT_IMPORT                     = "Import..."
IDC_GURGC_BTN_SECT_IMPORT_SHORT               = "Import..."
IDC_GURGC_FRAME_MAINBAR                       = "Main Bar"
IDC_GURGC_LABEL_MAIN_BAR                      = "Main Bar"
IDC_GURGC_FRAME_SECT_INFOR                    = "Section Information"
IDC_GURGC_RADIO_SECT_INFOR_SHAPE              = "Shape"
IDC_GURGC_RADIO_SECT_INFOR_MAINBAR            = "Main Bar"
IDC_GURGC_RADIO_SECT_INFOR_TIEBAR             = "Tie Bar"
IDC_GURGC_CHECK_SECT_INFOR_INDEX              = "Show Index"
IDC_GURGC_STC_SECT_INFOR_MIN_SPACE            = "Min. Space: "
IDC_GURGC_STC_SECT_INFOR_INSERT_KEY           = """Insert"" key : Insert new row at curr. cell"

/////// IDD_RCS_URGC_MLIST_COLM_DLG
IDD_RCS_URGC_MLIST_COLM_DLG                   = "Section Information"
IDC_GURGC_SEL_COLM_CURRENT_STC                = "Current Member"
IDC_GURGC_SEL_COLM_SELECT_STC                 = "Select Member"
IDC_GURGC_SEL_COLM_BTN_ALL                    = "All"
IDC_GURGC_SEL_COLM_BTN_NON                    = "None"
IDC_GURGC_SEL_COLM_BTN_INV                    = "Invert"
IDC_GURGC_SEL_COLM_SECTION_STC                = "Section Information"
IDC_GURGC_SEL_COLM_OK_BTN                     = "OK"
IDC_GURGC_SEL_COLM_CANCEL_BTN                 = "Cancel"

/////// IDD_RCS_URGC_PMODE_DLG
IDC_GURGC_RADIO_SECT_VIEW_SECTION             = "Section"
IDC_GURGC_RADIO_SECT_VIEW_PM_2D               = "PM Curve"
IDC_GURGC_RADIO_SECT_VIEW_MM_2D               = "MM Curve"
IDC_GURGC_LABEL_MAIN_BAR2                     = "-"
IDC_GURGC_FRAME_RESULT                        = "Calculation Result"

//// IDD_RCS_BASEWALL_INPUT_DLG
IDC_GURBW_RADIO_TYPE_1WAY                     = "1 Way"
IDC_GURBW_RADIO_TYPE_2WAY                     = "2 Way"
IDC_GURBW_BTN_SECTION_ADD                     = "Add"
IDC_GURBW_BTN_SECTION_DEL                     = "Delete"
IDC_GURBW_BTN_SECTION_IST                     = "Insert"
IDC_GURBW_RADIO_CRACK_DRY                     = "Dry"
IDC_GURBW_RADIO_CRACK_ETC                     = "Etc"
IDC_GURBW_CHK_ANAL_OPT_AUTO                   = "Auto"
IDC_GURBW_FRAME_DRAW                          = "Preview (Rebar && Diagram)"
IDC_GURBW_CHECK_PREVIEW_MESHLINE              = "Mesh Line"
IDC_GURBW_CHECK_PREVIEW_CONTOUR               = "Contour"
IDC_GURBW_CHECK_PREVIEW_VALUE                 = "Value"
IDC_GURBW_LABEL_FONT_SIZE                     = "Font Size :"
IDC_GURBW_BUTTON_REBAR_UPDATE                 = "Update Rebar Information (B1)"
IDC_GURBW_INPUT_BTN_REPORT                    = "Report ..."
IDC_GURBW_LABEL_VO_ITD                        = "Select item to display :"
IDC_GURBW_FRAME_MATERIAL                      = "Material"
IDC_GURBW_FRAME_SECTION                       = "Section"
IDC_GURBW_FRAME_LOAD                          = "Static Load"
IDC_GURBW_FRAME_SEIS                          = "Seismic Load"
IDC_GURBW_CHECK_LOAD                          = "Apply Static Pressure Load"
IDC_GURBW_CHECK_SEIS                          = "Apply Seismic Pressure Load"
IDC_GURBW_FRAME_BC                            = "Boundary Condition"
IDC_GURBW_FRAME_ANAL_OPT                      = "Analysis Option"
IDC_GURBW_LABEL_MATERIAL_FCK                  = "Concrete"
IDC_GURBW_LABEL_MATERIAL_MB                   = "Main Bar"
IDC_GURBW_LABEL_NAME                          = "Member Name"
IDC_GURBW_LABEL_MATERIAL_SB                   = "Sub Bar"
IDC_GURBW_LABEL_SECTION_COVER                 = "Cover"
IDC_GURBW_LABEL_SECTION_WIDTH                 = "Width"
IDC_GURBW_LABEL_BC_BOT                        = "Bottom"
IDC_GURBW_LABEL_BC_RIT                        = "Right"
IDC_GURBW_LABEL_ANAL_OPT_MESHSIZE             = "Mesh Size"
IDC_GURBW_LABEL_BC_LFT                        = "Left"
IDC_GURBW_LABEL_BC_TOP                        = "Top"
IDC_GURBW_LABEL_VO_STS                        = "Story to display :"
IDC_GURBW_LABEL_SECTION_TYPE                  = "Type"
IDC_GURBW_FRAME_REBAR                         = "Rebar Arrangement"
IDC_GURBW_LABEL_REBAR_MOMENT                  = "Moment"
IDC_GURBW_LABEL_REBAR_SHEAR                   = "Shear"
IDC_GURBW_LABEL_MATERIAL_FACT                 = "Factor"
IDC_GURBW_FRAME_CRACK                         = "Crack Condition"

//// IDD_RCS_BASEWALL_SMODE_INPUT_REBAR_DLG
IDC_GURBW_LABEL_UNIT2                         = "Unit :"
IDC_GURBW_LABEL_UNIT                          = "Unit"
IDC_GURBW_FRAME_REPORT_OPTION                 = "Report Option"
IDC_GURBW_LABEL_REBAR_ININO                   = "No. of Bars"

///// IDD_RCS_BASEWALL_SMODE_INPUT_SECT_DLG
IDC_GURBW_CHECK_MATERIAL_LCON                 = "Light Weight Concrete"

/////// IDD_RCS_BASEWALL_LIST_REBAR_DLG
IDD_RCS_BASEWALL_LIST_REBAR_DLG               = "Rebar Information"
IDC_GURBW_FRAME_SELECT_MEMBER                 = "Select Member"
IDC_GURBW_SELECT_BTN_ALL                      = "All"
IDC_GURBW_SELECT_BTN_NONE                     = "None"
IDC_GURBW_FRAME_REBAR_INFO                    = "Rebar Information"
IDC_GURBW_FRAME_MOMENT                        = "Moment"
IDC_GURBW_FRAME_SHEAR                         = "Shear"
IDC_GURBW_SOIL_BTN_APPLY                      = "Apply"
IDC_GURBW_SOIL_BTN_CANCEL                     = "Cancel"

//// IDD_RCS_BASEWALL_LIST_STORY_DLG
IDD_RCS_BASEWALL_LIST_STORY_DLG               = "Story Information"
IDC_GURBW_FRAME_STORY                         = "Story"
IDC_GURBW_SOIL_BTN_ADD                        = "Add"
IDC_GURBW_SOIL_BTN_DEL                        = "Delete"
IDC_GURBW_SOIL_BTN_IST                        = "Insert"

/// IDD_RCS_IMPORT_CAD_DLG
IDD_RCS_IMPORT_CAD_DLG                        = "Import AutoCAD File"
IDC_CAD_FILE_NAME_STC                         = "CAD File Name :"
IDC_CAD_FILE_BTN                              = "Browse..."
IDC_CAD_ALL_STC                               = "All Layers"
IDC_CAD_FOOTING_STC                           = "Footing Layer"
IDC_CAD_FOOTING_ADD_BTN                       = "->"
IDC_CAD_FOOTING_DEL_BTN                       = "<-"
IDC_CAD_PILE_STC                              = "Pile Layers"
IDC_CAD_PILE_ADD_BTN                          = "->"
IDC_CAD_PILE_DEL_BTN                          = "<-"
IDC_CAD_COLUMN_STC                            = "Column Layers"
IDC_CAD_COLUMN_ADD_BTN                        = "->"
IDC_CAD_COLUMN_DEL_BTN                        = "<-"
IDC_CAD_OK_BTN                                = "OK"
IDC_CAD_CANCEL_BTN                            = "Cancel"
IDC_CAD_SECTION_STC                           = "Section Layer"
IDC_CAD_SECTION_ADD_BTN                       = "->"
IDC_CAD_SECTION_DEL_BTN                       = "<-"
IDC_CAD_REBAR_STC                             = "Rebar Layers"
IDC_CAD_REBAR_ADD_BTN                         = "->"
IDC_CAD_REBAR_DEL_BTN                         = "<-"

/// IDD_RCS_RETAINING_WALL_INPUT_BASIC_DLG
IDC_GURRW_MATL_GRP                            = "Material"
IDC_GURRW_MATL_FCK_STC                        = "Concrete"
IDC_GURRW_MATL_MB_STC                         = "Main Bar"
IDC_GURRW_MATL_SB_STC                         = "Sub Bar"
IDC_GURRW_MATL_LCON_CHK                       = "Light Weight Concrete"
IDC_GURRW_MATL_FACT_STC                       = "Factor"
IDC_GURRW_INFO_GRP                            = "Basic Information"
IDC_GURRW_INFO_TYPE_STC                       = "Type"
IDC_GURRW_INFO_TOTAL_H_STC                    = "Total Height"
IDC_GURRW_STEM_GRP                            = "Stem"
IDC_GURRW_STEM_TOP_THK_STC                    = "Top Thick."
IDC_GURRW_STEM_BOT_THK_STC                    = "Bottom Thick."
IDC_GURRW_STEM_BACK_SLOPE_STC                 = "Back Slope Dist."
IDC_GURRW_STEM_COVER_FRONT_STC                = "Cover ( Front )"
IDC_GURRW_STEM_COVER_BACK_STC                 = "Cover ( Back )"
IDC_GURRW_FDN_GRP                             = "Foundation"
IDC_GURRW_FDN_DEPTH_STC                       = "Depth"
IDC_GURRW_FDN_SLOPE_DEPTH_STC                 = "Slope Depth"
IDC_GURRW_FDN_TOE_LENG_STC                    = "Toe Length"
IDC_GURRW_FDN_HEEL_LENG_STC                   = "Heel Length"
IDC_GURRW_FDN_COVER_STC                       = "Cover"
IDC_GURRW_SKEY_GRP                            = "Shear Key"
IDC_GURRW_SKEY_USE_CHK                        = "Use Shear Key"
IDC_GURRW_SKEY_LOCATION_STC                   = "Location"
IDC_GURRW_SKEY_HEIGHT_STC                     = "Height"

///// IDD_RCS_RETAINING_WALL_INPUT_DLG
IDC_GURRW_FRAME_DRAW                          = "Preview"
IDC_GURRW_FRAME_STABILITY_RESULT              = "Stability Calculation Result"
IDC_GURRW_FRAME_REBAR                         = "Rebar Arrangement"
IDC_GURRW_INPUT_BTN_REPORT                    = "Report ..."
IDC_GURRW_LABEL_VO_ITD                        = "Select item to display :"

////// IDD_RCS_RETAINING_WALL_SMODE_REBAR_DLG
IDC_GURRW_RBAR_STEM_GRP                       = "Stem Rebar"
IDC_GURRW_RBAR_STEM_VFRONT                    = "Ver. Bar ( Front )"
IDC_GURRW_RBAR_STEM_VBACK_STC                 = "Ver. Bar ( Back )"
IDC_GURRW_RBAR_STEM_HORZ_STC                  = "Hor. Bar"
IDC_GURRW_RBAR_FDN_GRP                        = "Foundation Rebar"
IDC_GURRW_RBAR_FDN_TOE_STC                    = "Toe Bar ( Bottom )"
IDC_GURRW_RBAR_FDN_HEEL_STC                   = "Heel Bar ( Top )"
IDC_GURRW_RBAR_FDN_DIST_STC                   = "Distribution Bar"
IDC_GURRW_RBAR_SKEY_GRP                       = "Shear Key"
IDC_GURRW_RBAR_SKEY_VERT_STC                  = "Ver. Bar"

///// IDD_RCS_RETAINING_WALL_INPUT_SOILLOAD_DLG
IDC_GURRW_BACKFILL_GRP                        = "Back Fill"
IDC_GURRW_BACKFILL_INCLINE_CHK                = "Inclined Back Fill"
IDC_GURRW_BACKFILL_SLOPE_STC                  = "Slope  =  1:"
IDC_GURRW_BACKFILL_HEIGHT_STC                 = "Height"
IDC_GURRW_BACKFILL_PHI_STC                    = "Friction Angle"
IDC_GURRW_BACKFILL_DENSITY_STC                = "Density"
IDC_GURRW_SURCHARGE_GRP                       = "Surcharge Load"
IDC_GURRW_BACKFILL_SUR_FLAT_STC               = "Flat"
IDC_GURRW_BACKFILL_SUR_SLOPE_STC              = "Slope"
IDC_GURRW_FDN_GRND_GRP                        = "Foundation Ground"
IDC_GURRW_FDN_GRND_PHI_STC                    = "Friction Angle"
IDC_GURRW_FND_GRND_C_STC                      = "Cohesion"
IDC_GURRW_FDN_GRND_QA_STC                     = "Bearing Capa."
IDC_GURRW_LOAD_GRP                            = "Load"
IDC_GURRW_LOAD_SOIL_FACT_STC                  = "Soil Factor"
IDC_GURRW_LOAD_WATER_LELVE_STC                = "Water Level"
IDC_GURRW_LOAD_WALTER_FACT_STC                = "Water Factor"
IDC_GURRW_FRNTFILL_GRP                        = "Front Fill"
IDC_GURRW_FRNTFILL_CONSIDER_CHK               = "Consider Front Fill"

// IDD_RCS_FOOT_PMODE_DLG
IDC_GUFDN_CHECK_MATERIAL_LCON                 = "Light Weight Concrete"
IDC_GUFDN_INPUT_BTN_LCOMB_SERV                = "Load Combinations ..."
IDC_GUFDN_INPUT_BTN_LCOMB_FACT                = "Load Combinations ..."
IDC_GURFD_CHK_DLOAD_SW                        = "Include Self-Weight"
IDC_GURFD_INPUT_BTN_SWITCH                    = "Mx <-> My"
IDC_GURFD_LABEL_FD_TYPE                       = "Type"
IDC_GURFD_LABEL_FD_THICKNESS                  = "Depth"
IDC_GURFD_LABEL_FD_COVER                      = "Cover"
IDC_GURFD_RADIO_RECTANGLE                     = "Rectangle"
IDC_GURFD_RADIO_CIRCLE                        = "Circle"
IDC_GURFD_FRAME_REBAR                         = "Rebar"
IDC_GURFD_FRAME_ARRANGE_X                     = "Bar Arrangement (X Direction)"
IDC_GURFD_FRAME_FOUND_SIZE                    = "Footing Size"
IDC_GURFD_FRAME_ARRANGE_Y                     = "Bar Arrangement (Y Direction)"
IDC_GURFD_FRAME_ARRANGE_ETC                   = "Calculation Result"
IDC_GURFD_FRAME_MATERIAL                      = "Material"
IDC_GURFD_LABEL_MATERIAL_FCK                  = "Concrete"
IDC_GURFD_LABEL_MATERIAL_MB                   = "Main Bar"
IDC_GURFD_FRAME_DESIGN_LOAD                   = "Design Load"
IDC_GURFD_LABEL_DLOAD_PS                      = "Ps"
IDC_GURFD_LABEL_DLOAD_MSX                     = "Msx"
IDC_GURFD_LABEL_DLOAD_MSY                     = "Msy"
IDC_GURFD_LABEL_DLOAD_PU                      = "Pu"
IDC_GURFD_LABEL_DLOAD_MUX                     = "Mux"
IDC_GURFD_LABEL_DLOAD_MUY                     = "Muy"
IDC_GURFD_FRAME_SURCHARGE_LOAD                = "Surcharge Load"
IDC_GURFD_LABEL_SLOAD_SL                      = "Surface Load"
IDC_GURFD_LABEL_SLOAD_WD                      = "Weight Density"
IDC_GURFD_LABEL_SLOAD_H                       = "Height"
IDC_GURFD_FRAME_FOUNDATION                    = "Footing"
IDC_GURFD_FRAME_COLUMN_SECTION                = "Column Section"
IDC_GURFD_LABEL_CS_CX                         = "Cx"
IDC_GURFD_LABEL_CS_CY                         = "Cy"
IDC_GURFD_LABEL_CS_EX                         = "Ex"
IDC_GURFD_LABEL_CS_EY                         = "Ey"
IDC_GUFDN_LABEL_MATERIAL_FACT                 = "Factor"
IDC_GURFD_LABEL_COLMPOS_TYPE                  = "Position"
IDC_GURFD_FRAME_SHFOROPT                      = "Shear Force Option"
IDC_GUFDN_CHECK_SHFOR_SURCHARGE               = "Include Surcharge Load"

// IDD_RCS_FOUNDATION_SMODE_SECT_DLG_EC
IDC_GURFD_LABEL_DLOAD_NS                      = "N.Ed.s"
IDC_GURFD_LABEL_DLOAD_MSXS                    = "M.Ed.sx"
IDC_GURFD_LABEL_DLOAD_MSYS                    = "M.Ed.sy"
IDC_GURFD_LABEL_DLOAD_NU                      = "N.Ed.u"
IDC_GURFD_LABEL_DLOAD_MUXS                    = "M.Ed.ux"
IDC_GURFD_LABEL_DLOAD_MUYS                    = "M.Ed.uy"

// IDD_RCS_FOUNDATION_INPUT_DLG_EC
IDC_GURFD_LABEL_DLOAD_EC_PS                   = "N.Ed.s"
IDC_GURFD_LABEL_DLOAD_EC_MSX                  = "M.Ed.sx"
IDC_GURFD_LABEL_DLOAD_EC_MSY                  = "M.Ed.sy"
IDC_GURFD_LABEL_DLOAD_EC_PU                   = "N.Ed.u"
IDC_GURFD_LABEL_DLOAD_EC_MUX                  = "M.Ed.ux"
IDC_GURFD_LABEL_DLOAD_EC_MUY                  = "M.Ed.uy"

// IDD_RCS_FOUNDATION_LIST_DLG_EC
IDC_GUFDN_LIST_RADIO_MAT                      = "Isolated"
IDC_GUFDN_LIST_RADIO_PILE                     = "Pile"
IDC_GUFDN_LIST_LBL_FOOT                       = "Type"
IDC_GUFDN_LIST_RADIO_STRIP                    = "Strip"

// IDD_RCS_FOOT_RBAR_DLG
IDC_GURFD_FRAME_PROPERTY                      = "Property"
IDC_GURFD_FRAME_RBAR                          = "Rebar"
IDC_GURFD_LABEL_RBAR_INIT_X                   = "Initial Bar (x)"
IDC_GURFD_LABEL_RBAR_INIT_Y                   = "Initial Bar (Y)"
IDC_GURFD_LABEL_BAR_NO                        = "No. of Bars"

// IDD_RCS_FOUNDATION_SMODE_RBAR_DLG_EC
IDC_GURFD_RADIO_STRIP                         = "Strip"

// IDD_RCS_BUTTRESS_LIST_REBAR_DLG
IDD_RCS_BUTTRESS_LIST_REBAR_DLG               = "Rebar Information"
IDC_GURBU_SELECT_MEMBER_FRM                   = "Select Member"
IDC_GURBU_SELECT_BTN_ALL                      = "All"
IDC_GURBU_SELECT_BTN_NONE                     = "None"
IDC_GURBU_REBAR_INFO_FRM                      = "Rebar Information"
IDC_GURBU_FRAME_REBAR                         = "Rebar"
IDC_GURBU_LABEL_BARTYPE                       = "Rebar Type"
IDC_GURBU_FRAME_PREVIEW_OPTION                = "Preview Option"
IDC_GURBU_RADIO_REBAR_TYPE1                   = "Type-1 (All Section)"
IDC_GURBU_RADIO_REBAR_TYPE2                   = "Type-2 (Both End && Center)"
IDC_GURBU_RADIO_REBAR_TYPE3                   = "Type-3 (Each End && Center)"
IDC_GURBU_FRAME_SKINBAR                       = "Skin Bar"
IDC_GURBU_CHECK_DISTRIBUTE                    = "Evenly at side"
IDC_GURBU_STORY_FRM                           = "Story"
IDC_GURBU_SOIL_BTN_APPLY                      = "Apply"
IDC_GURBU_SOIL_BTN_CANCEL                     = "Cancel"
IDC_GURBU_LABEL_SKINBAR                       = "Skin Bar"
IDC_GURBU_LABEL_SKINBAR2                      = "-"
IDC_GURBU_LABEL_STORY                         = "Story to modify :"

// IDD_RCS_BUTTRESS_SUPPORT_DLG
IDD_RCS_BUTTRESS_SUPPORT_DLG                  = "Support Condition of Basement Wall"
IDC_GURBU_FRM_SUPPORT_WALL                    = "Support Condition of Basement Wall"

// IDD_RCS_BUTTRESS_SMODE_INPUT_DLG
IDC_GURBU_LABEL_FONT_SIZE                     = "Font Size"
IDC_GURBU_INPUT_BTN_REPORT                    = "Report ..."

// IDD_RCS_BUTTRESS_SMODE_REBAR_DLG
IDC_GURBU_LABEL_LAYER_NO                      = "Maximum Layer No."
IDC_GURBU_LABEL_UNIT2                         = "Unit :"
IDC_GURBU_LABEL_UNIT                          = "Unit"
IDC_GURBU_FRAME_REPORT_OPTION                 = "Report Option"
IDC_GURBU_CHECK_PREVIEW_MESHLINE              = "Mesh Line"
IDC_GURBU_CHECK_PREVIEW_CONTOUR               = "Contour"
IDC_GURBU_CHECK_PREVIEW_VALUE                 = "Value"
IDC_GURBU_CHECK_OPTION_AUTO                   = "Auto"
IDC_GURBU_FRAME_OPTION                        = "Analysis Option"
IDC_GURBU_LABEL_OPTION_MESHSIZE               = "Mesh Size"

// IDD_RCS_BUTTRESS_SMODE_INPUT_SECT_DLG
IDC_GURBU_CHECK_MATERIAL_LCON                 = "Light Weight Concrete"
IDC_GURBU_FRAME_MATERIAL                      = "Material"
IDC_GURBU_LABEL_MATERIAL_FCK                  = "Concrete"
IDC_GURBU_LABEL_MATERIAL_FY                   = "Main Bar"
IDC_GURBU_LABEL_MATERIAL_FYS                  = "Stirrup"
IDC_GURBU_FRAME_SECTION                       = "Section"
IDC_GURBU_BTN_SECTION_ADD                     = "Add"
IDC_GURBU_BTN_SECTION_DEL                     = "Delete"
IDC_GURBU_BTN_SECTION_INS                     = "Insert"
IDC_GURBU_BTN_SUPPORT_WALL                    = "Support Condition of Basement Wall ..."
IDC_GURBU_LABEL_SECTION_COVER                 = "Cover"
IDC_GURBU_LABEL_SECTION_LENGTH_L              = "Length(Left)"
IDC_GURBU_LABEL_SECTION_LENGTH_M              = "Length(Middle)"
IDC_GURBU_LABEL_SECTION_LENGTH_R              = "Length(Right)"
IDC_GURBU_FRAME_LOAD                          = "Static Load"
IDC_GURBU_FRAME_SEIS                          = "Seismic Load"
IDC_GURBU_CHECK_LOAD                          = "Apply Static Pressure Load"
IDC_GURBU_CHECK_SEIS                          = "Apply Seismic Pressure Load"
IDC_GURBU_RADIO_CRACK_DRY                     = "Dry"
IDC_GURBU_RADIO_CRACK_ETC                     = "Etc"
IDC_GURBU_FRAME_SPLICE                        = "Spacing Limit of Main Rebar"
IDC_GURBU_RADIO_SPLICE000                     = "Do not splice"
IDC_GURBU_RADIO_SPLICE050                     = "50% Splice"
IDC_GURBU_RADIO_SPLICE100                     = "100% Splice"
IDC_GURBU_FRAME_BOUNDARY                      = "Boundary Condition of Buttress"
IDC_GURBU_LABEL_BOUNDARY_TOP                  = "Top"
IDC_GURBU_LABEL_BOUNDARY_BOT                  = "Bottom"
IDC_GURBU_LABEL_MATERIAL_FACT                 = "Factor"
IDC_GURBU_FRAME_CRACK                         = "Crack Condition"
IDC_GURBU_LABEL_PREVIEW_ITEM                  = "Select item to display :"
IDC_GURBU_FRAME_PREVIEW                       = "Preview (Rebar && Diagram)"

// IDD_RCS_URSL_SPACE_DLG
IDD_RCS_URSL_SPACE_DLG                        = "Space Information"
IDC_GURSL_SELECT_MEMBER_FRM                   = "Select Member"
IDC_GURSL_LIST_BUTTON_SELECT_ALL              = "All"
IDC_GURSL_LIST_BUTTON_SELECT_NONE             = "None"
IDC_GURSL_SPACE_FRM                           = "Space"
IDC_GURSL_LIST_BUTTON_ADD                     = "Add"
IDC_GURSL_LIST_BUTTON_DEL                     = "Delete"
IDC_GURSL_LIST_BUTTON_INS                     = "Insert"
IDC_GURSL_LIST_BUTTON_APPLY                   = "Apply"
IDC_GURSL_LIST_BUTTON_CANCEL                  = "Cancel"

// IDD_RCS_URSL_THICK_DLG
IDD_RCS_URSL_THICK_DLG                        = "Thickness Information"
IDC_GURSL_MEMBER_FRM                          = "Select Member"
IDC_GURSL_THICK_FRM                           = "Thickness"
IDC_GURSL_LIST_CHECK_SAME_COVER               = "Use same cover"

// IDD_RCS_SOIL_PAGE_STAT_DLG
IDC_RCS_SOIL_RADIO_SOIL                       = "by Soil Property"
IDC_RCS_SOIL_RADIO_USER                       = "by User"

// IDD_RCS_SOIL_PAGE_SOIL_DLG
IDC_SOIL_LOAD_LABEL_WL_GL                     = "GL"
IDC_SOIL_LOAD_LABEL_SURCHARGE                 = "Surcharge Load"
IDC_SOIL_LOAD_LABEL_WATER_LEVEL               = "Water Level"
IDC_SOIL_LOAD_LABEL_WATER_F                   = "Water Factor"
IDC_SOIL_LOAD_LABEL_1ST_GL                    = "GL"
IDC_SOIL_LOAD_LABEL_PROPERTY                  = "Soil Properties"
IDC_SOIL_LOAD_LABEL_LIVE_F                    = "Live Factor"
IDC_SOIL_LOAD_LABEL_SOIL_F                    = "Soil Factor"
IDC_SOIL_LOAD_LABEL_1ST_LEVEL                 = "1st FL Level"

// IDD_RCS_SOIL_PAGE_USER_DLG
IDC_SOIL_LOAD_BTN_ADD                         = "Add"
IDC_SOIL_LOAD_BTN_DEL                         = "Delete"
IDC_SOIL_LOAD_BTN_INS                         = "Insert"

// IDD_RCS_SOIL_USER_DLG
IDD_RCS_SOIL_USER_DLG                         = "Soil Load"
IDC_SOIL_LOAD_USER_FRM                        = "User defined load"
IDC_SOIL_LOAD_BTN_OK                          = "OK"
IDC_SOIL_LOAD_BTN_CANCEL                      = "Cancel"

/////// IDD_RCS_COLUMN_PMODE_DLG
IDC_GURCO_FRAME_MATERIAL                      = "Material"
IDC_GURCO_LABEL_MATERIAL_FCK                  = "Concrete"
IDC_GURCO_LABEL_MATERIAL_MB                   = "Main Bar"
IDC_GURCO_LABEL_MATERIAL_HB                   = "Hoop Bar"
IDC_GURCO_CHECK_MATERIAL_LCON                 = "Light Weight Concrete"
IDC_GURCO_LABEL_MATERIAL_FACT                 = "Factor"
IDC_GURCO_FRAME_SHAPE                         = "Shape"
IDC_GURCO_RADIO_SHAPE_RECT                    = "Rectangle"
IDC_GURCO_RADIO_SHAPE_CIRCLE                  = "Circle"
IDC_GURCO_FRAME_SECTION                       = "Section"
IDC_GURCO_LABEL_SECTION_WIDTH                 = "Width"
IDC_GURCO_LABEL_SECTION_HEIGHT                = "Height"
IDC_GURCO_LABEL_SECTION_CORNER                = "Corner"
IDC_GURCO_LABEL_SECTION_LENGTH_X              = "Length(x)"
IDC_GURCO_LABEL_SECTION_LENGTH_Y              = "Length(y)"
IDC_GURCO_LABEL_SECTION_KFACTOR_X             = "Kx"
IDC_GURCO_LABEL_SECTION_KFACTOR_Y             = "Ky"
IDC_GURCO_FRAME_FORCE                         = "Axial Force && Moment"
IDC_GURCO_LABEL_FORCE_AXF                     = "Axial"
IDC_GURCO_CHECK_APPLY2SHEAR                   = "Apply to Shear Check"
IDC_GURCO_LABEL_FORCE_MEMX                    = "Moment(x)"
IDC_GURCO_LABEL_FORCE_MEMY                    = "Moment(y)"
IDC_GURCO_FRAME_SHEAR                         = "Shear Force"
IDC_GURCO_LABEL_FORCE_AXIAL_X                 = "Axial(x)"
IDC_GURCO_LABEL_FORCE_SHX                     = "Shear(x)"
IDC_GURCO_LABEL_FORCE_AXIAL_Y                 = "Axial(y)"
IDC_GURCO_LABEL_FORCE_SHY                     = "Shear(y)"
IDC_GURCO_FRAME_COE                           = "Coefficient / Factor"
IDC_GURCO_LABEL_COE_CMX                       = "Cmx"
IDC_GURCO_LABEL_COE_CMY                       = "Cmy"
IDC_GURCO_LABEL_COE_BETAD                     = "βd"
IDC_GURCO_BTN_LCOMB                           = "Load Combinations ..."
IDC_FRM_2ND_ORDER 						      = "2nd Order Effect"
IDC_CHK_2ND_ORDER 						      = "Consider 2nd Order Effect"
IDC_GURCO_FRAME_ARRANGE                       = "Rebar Arrangement"
IDC_GURCO_FRAME_REBAR                         = "Rebar"
IDC_GURCO_FRAME_TIEBAR                        = "Tie Bar"
IDC_GURCO_CHECK_TIEBAR                        = "Apply to Shear Check"
IDC_GURCO_LABEL_TIEBAR_MATL                   = "Material"
IDC_GURCO_LABEL_TIEBAR_RBAR                   = "Rebar"
IDC_GURCO_FRAME_SPLICE                        = "Spacing Limit of Main Rebar"
IDC_GURCO_RADIO_SPLICE000                     = "Do not splice"
IDC_GURCO_RADIO_SPLICE050                     = "50% Splice"
IDC_GURCO_RADIO_SPLICE100                     = "100% Splice"
IDC_GURCO_FRAME_SEISMIC_DESIGN                = "Seismic Design"
IDC_GURCO_CHECK_SEISMIC_PROVISIONS            = "Apply Special Provisions"
IDC_GURCO_RADIO_SPECIAL_MOMENT                = "SMF"
IDC_GURCO_RADIO_INTERMEDIATE_MOMENT           = "IMF"
IDC_GURCO_RADIO_ORDINARY_MOMENT               = "OMF"
IDC_GURCO_FRAME_DESIGN_OPTION                 = "Design Option"
IDC_GURCO_CHECK_USER_RHO                      = "User Define Reinforcement"
IDC_GURCO_LABEL_MIN_RHO                       = "Min. Ratio"
IDC_GURCO_LABEL_MAX_RHO                       = "Max. Ratio"
IDC_GURCO_FRAME_PM_CURVE                      = "PM Interaction Curve"
IDC_GURCO_FRAME_RESULT                        = "Calculation Result"
IDC_GURCO_CHECK_SEISMIC_PILOTI_KDS            = "Apply Pilotis Provisions, KDS 41 17 00"

/////// IDD_RCS_COLUMN_RBAR_DLG
IDC_GURCO_LABEL_UNIT2                         = "Unit : "
IDC_GURCO_LABEL_UNIT                          = "Unit"
IDC_GURCO_CHECK_USEUSERINPUT                  = "Use user input hoop bar (End)"
///////IDD_RCS_COLM_INPUT_SECT3_DLG_EC
IDC_GURCO_CHK_SERVICEABILITY                  = "Check Serviceability"
IDC_GURCO_FRAME_FACTORS                       = "Factors (Stress Limitation)"
IDC_GURCO_SERVICE_FACTOR_K1                   = "k1"
IDC_GURCO_SERVICE_FACTOR_K2                   = "k2"
IDC_GURCO_SERVICE_FACTOR_K3                   = "k3"

/////// IDD_URDW_PMODE_DLG
IDC_GURDW_FRAME_SECTION                       = "Section"
IDC_GURDW_CHK_DRAW_INDX                       = "Index"
IDC_GURDW_CHK_DRAW_AXIS                       = "Local Axis"
IDC_GURDW_CHK_DRAW_DIMS                       = "Dimension"
IDC_GURDW_CHK_DRAW_VBAR                       = "Ver. Bar"
IDC_GURDW_CHK_DRAW_HBAR                       = "Hor. Bar"
IDC_GURDW_CHK_DRAW_NAME                       = "Wall Name"
IDC_GURDW_CHK_DRAW_INFO                       = "Rebar Info."
IDC_GURDW_FRAME_RESULT                        = "Calculation Result"
IDC_GURDW_LABEL_EFFSECT                       = "Effective Section : "
IDC_GURDW_LABEL_TXTSIZE                       = "Text Size : "
IDC_GURDW_FRAME_PMCURVE                       = "P-M Curve"

/////// IDD_RCS_COMBINED_WALL_INPUT_DLG_EC
IDC_GURDW_FRAME_MNCURVE                       = "M-N Curve"

/////// IDD_URDW_SECT_DLG
IDC_GURDW_FRAME_MATERIAL                      = "Material"
IDC_GURDW_LABEL_MATERIAL_FCK                  = "Concrete"
IDC_GURDW_LABEL_MATERIAL_MB                   = "Ver. Bar"
IDC_GURDW_LABEL_MATERIAL_HB                   = "Hor. Bar"
IDC_GURDW_CHECK_MATERIAL_LCON                 = "Light Weight Concrete"
IDC_GURDW_LABEL_MATERIAL_FACT                 = "Factor"
IDC_GURDW_FRAME_LENGTH                        = "Length"
IDC_GURDW_LABEL_LENGTH_X                      = "Length(x)"
IDC_GURDW_LABEL_LENGTH_Y                      = "Length(y)"
IDC_GURDW_LABEL_KFACTOR_X                     = "Kx"
IDC_GURDW_LABEL_KFACTOR_Y                     = "Ky"
IDC_GURDW_FRAME_EFF_AREA                      = "Equivalent Dimension"
IDC_GURDW_LABEL_EFF_AREA_B                    = "Width (B)"
IDC_GURDW_LABEL_EFF_AREA_H                    = "Height (D)"
IDC_GURDW_BTN_EFF_AREA_CALC                   = "Determine by Cross-Section"
IDC_GURDW_FRAME_TRANSFER                      = "Transfer Combined Wall"
IDC_GURDW_LBL_TRANSFER_WALL                   = "Basis Wall"
IDC_GURDW_LBL_TRANSFER_DIR                    = "Parallel Dir."
IDC_GURDW_LBL_TRANSFER_ANGLE                  = "Trans. Angle"
IDC_GURDW_TRANS_BTN                           = "Transfer"
IDC_GURDW_FRAME_SPLICE                        = "Spacing Limit of Main Rebar"
IDC_GURDW_RADIO_SPLICE000                     = "Do not splice"
IDC_GURDW_RADIO_SPLICE050                     = "50% Splice"
IDC_GURDW_RADIO_SPLICE100                     = "100% Splice"

/////// IDD_RCS_COMBINED_WALL_INPUT_SECT1_DLG_EC
IDC_GURDW_FRAME_FLANGE_WIDTH                  = "Flange Width"
IDC_GURDW_RADIO_ACTU_WIDT                     = "Actual Width"
IDC_GURDW_RADIO_EFFE_WIDT                     = "Effective Width"
IDC_GURDW_FRAME_COE_EC                        = "Effective Creep Ratio"
IDC_GURDW_CREEP_COEFFICIENT_STC               = "Ratio"
IDC_GURDW_FRAME_DGN_MOMENT                    = "Design Moment"
IDC_GURDW_SLEN_IMPER_CHK                      = "Consider Effect of Imperfections"
IDC_GURDW_SLEN_2ND_CHK                        = "Consider 2nd Order Effects"
IDC_GURDW_LBL_DGN_MOMENT_LAMLIM               = "λlim = 20*A*B*C/sqrt(n)"
IDC_GURDW_SLEN_CHK_A                          = "Calc. by Program"
IDC_GURDW_SLEN_CHK_B                          = "Calc. by Program"
IDC_GURDW_SLEN_CHK_C                          = "Calc. by Program"

/////// IDD_URDW_WALL_DLG
/////// IDD_RCS_COMBINED_WALL_INPUT_SECT2_DLG_EC
IDC_GURDW_FRAME_UNITWALL                      = "Select Unit Wall"
IDC_GURDW_BTN_ADD                             = "Add"
IDC_GURDW_BTN_MOD                             = "Modify"
IDC_GURDW_BTN_DEL                             = "Delete"
IDC_GURDW_BTN_WALL_DATA                       = "Wall Data..."
IDC_GURDW_FRAME_REBAR                         = "Rebar"
IDC_GURDW_LABEL_UNIT2                         = "Unit : "
IDC_GURDW_LABEL_UNIT                          = "Unit"
IDC_GURDW_LABEL_REBAR_VER                     = "Ver."
IDC_GURDW_REBAR_HOR                           = "Hor."
IDC_GURDW_REBAR_END                           = "End."
IDC_GURDW_FRAME_REBAR_ARR                     = "Rebar Arrangement"
IDC_GURDW_RDO_EQUAL_SPACE                     = "Divide equally by nearest space"
IDC_GURDW_RDO_EXACT_SPACE                     = "Divide by exact space"
IDC_GURDW_RDO_FROM_END                        = "From End"
IDC_GURDW_RDO_FROM_MIDDLE                     = "From Middle"
IDC_GURDW_CHK_ADD_REBAR                       = "Add Additional Rebar"
IDC_GURDW_LABEL_THICK                         = "Thick"
IDC_GURDW_LABEL_COVER                         = "Cover"
IDC_GURDW_FRAME_SECT_INFOR                    = "Section Information"
IDC_GURDW_RADIO_SECT_INFOR_SHAPE              = "Position"
IDC_GURDW_RADIO_SECT_INFOR_MAINBAR            = "Ver. Bar"
IDC_GURDW_SECTION_INFO                        = """Insert"" key : Insert new row at curr. cell"

/////// IDD_URDW_FORC_DLG
IDC_GURDW_FRAME_FORCE_FACTOR                  = "Force && Factor"
IDC_GURDW_BTN_LCOMB                           = "Load Combinations ..."
IDC_GURDW_FRAME_FORCE                         = "Axial Force && Moment"
IDC_GURDW_LABEL_FORCE_AXF                     = "Axial"
IDC_GURDW_CHECK_APPLY2SHEAR                   = "Apply to Shear Check"
IDC_GURDW_LABEL_FORCE_MX                      = "Moment(x)"
IDC_GURDW_LABEL_FORCE_MY                      = "Moment(y)"
IDC_GURDW_FRAME_SHEAR                         = "Shear Force"
IDC_GURDW_LABEL_FORCE_VY                      = "Shear(y)"
IDC_GURDW_LABEL_FORCE_PY                      = "Axial(y)"
IDC_GURDW_LABEL_FORCE_MX4V                    = "Moment(x)"
IDC_GURDW_FRAME_COE                           = "Coefficient / Factor"
IDC_GURDW_LABEL_COE_CMX                       = "Cmx"
IDC_GURDW_LABEL_COE_CMY                       = "Cmy"
IDC_GURDW_LABEL_COE_BETAD                     = "βd"

/////// IDD_RCS_COMBINED_WALL_INPUT_SECT3_DLG_EC
IDC_GURDW_LABEL_FORCE_MEMXI                   = "Moment(xi)"
IDC_GURDW_LABEL_FORCE_MEMXJ                   = "Moment(xj)"
IDC_GURDW_LABEL_FORCE_MEMYI                   = "Moment(yi)"
IDC_GURDW_LABEL_FORCE_MEMYJ                   = "Moment(yj)"
IDC_GURDW_LABEL_FORCE_AXIAL_X                 = "Axial(x)"
IDC_GURDW_LABEL_FORCE_SHX                     = "Shear(x)"
IDC_GURDW_LABEL_FORCE_AXIAL_Y                 = "Axial(y)"
IDC_GURDW_LABEL_FORCE_SHY                     = "Shear(y)"

/////// IDD_URDW_WALL_DATA_DLG
/////// IDD_RCS_COMBINED_WALL_INPUT_WALL_DLG_EC
IDD_URDW_WALL_DATA_DLG                        = "Wall Data"
IDC_GURDW_FRM_SECTION                         = "Section"
IDC_RCS_GURDW_WALL_BTN_ADD                    = "&Add"
IDC_RCS_GURDW_WALL_BTN_INS                    = "&Insert"
IDC_RCS_GURDW_WALL_BTN_DEL                    = "&Delete"
IDC_RCS_GURDW_WALL_BTN_OK                     = "&OK"
IDC_RCS_GURDW_WALL_BTN_CANCEL                 = "&Cancel"

/////// IDD_URDW_MLIST_INFO_DLG
/////// IDD_RCS_COMBINED_WALL_LIST_INFO_DLG_EC
IDD_URDW_MLIST_INFO_DLG                       = "Section Information"
IDC_GURDW_FRM_MEMB_CUR                        = "Current Member"
IDC_GURDW_FRM_MEMB_SEL                        = "Select Member"
IDC_GURDW_SEL_COLM_BTN_ALL                    = "All"
IDC_GURDW_SEL_COLM_BTN_NON                    = "None"
IDC_GURDW_SEL_COLM_BTN_INV                    = "Invert"

/////// IDD_RCS_DESIGN_LOAD
IDC_RCS_DESIGN_LOAD_DEL_CANCEL                = "Invalid Cell Selected. Delete Cancelled."
IDC_RCS_DESIGN_LOAD_INS_CANCEL                = "Invalid Cell Selected. Insert Cancelled."
IDC_RCS_DESIGN_LOAD_ENTER_NAME                = "Enter Name."
IDC_RCS_DESIGN_LOAD_SAME_NAME_EXIST           = "Data with same name Exist."
IDC_RCS_DESIGN_LOAD_DEAD_NAME_I               = "Load Name%i"

/////// IDD_RCS_DEVELOP_SPLICING_DLG
IDD_RCS_DEVELOP_SPLICING_DLG                  = "Development & Splicing"
IDC_RCS_DEVELOP_SPLICING_CALCTYPE             = "Calculation Type"
IDC_RCS_DEVELOP_SPLICING_CALC                 = "Calculation"
IDC_RCS_DEVELOP_SPLICING_RESULT               = "Result"
IDC_RCS_DEVELOP_SPLICING_TRANS                = "Transparency"

/////// IDD_RCS_DEVELOP_SIMPLE_DLG
IDC_RCS_DEVELOP_SIMPLE_FORMULA                = "Formula"
IDC_RCS_DEVELOP_SIMPLE_MATERIAL               = "Material"
IDC_RCS_DEVELOP_SIMPLE_REBAR                  = "Rebar"
IDC_RCS_DEVELOP_SIMPLE_FACTOR                 = "Factor"
IDC_RCS_DEVELOP_SIMPLE_BAR                    = "main bar"
IDC_RCS_DEVELOP_SIMPLE_COVER                  = "Cover"
IDC_RCS_DEVELOP_SIMPLE_FSP                    = "Use Fsp"

/////// IDD_RCS_DEVELOP_DETAIL_DLG
IDC_RCS_DEVELOP_DETAIL_FORMULA                = "Formula"
IDC_RCS_DEVELOP_DETAIL_MATERIAL               = "Material"
IDC_RCS_DEVELOP_DETAIL_REBAR                  = "Rebar"
IDC_RCS_DEVELOP_DETAIL_FACTOR                 = "Factor"
IDC_RCS_DEVELOP_DETAIL_BAR                    = "main bar"
IDC_RCS_DEVELOP_DETAIL_MAINSPACE              = "Space"
IDC_RCS_DEVELOP_DETAIL_COVER                  = "Cover"
IDC_RCS_DEVELOP_DETAIL_FSP                    = "Use Fsp"
IDC_RCS_DEVELOP_DETAIL_KTR                    = "Calc Ktr"
IDC_RCS_DEVELOP_DETAIL_STIRRUP                = "Stirrup"
IDC_RCS_DEVELOP_DETAIL_SPACE                  = "Space"
IDC_RCS_DEVELOP_DETAIL_AS                     = "Use As Ratio"
IDC_RCS_DEVELOP_DETAIL_AS_REQ                 = "As, req"
IDC_RCS_DEVELOP_DETAIL_AS_USE                 = "As, use"

/////// IDD_RCS_DEVELOP_COMP_DLG
IDC_RCS_DEVELOP_COMP_FORMULA                  = "Formula"
IDC_RCS_DEVELOP_COMP_MATERIAL                 = "Material"
IDC_RCS_DEVELOP_COMP_REBAR                    = "Rebar"
IDC_RCS_DEVELOP_COMP_FACTOR                   = "Factor"
IDC_RCS_DEVELOP_COMP_BAR                      = "main bar"
IDC_RCS_DEVELOP_COMP_AS                       = "Use As Ratio"
IDC_RCS_DEVELOP_COMP_AS_REQ                   = "As, req"
IDC_RCS_DEVELOP_COMP_AS_USE                   = "As, use"

/////// IDD_RCS_DEVELOP_HOOK_DLG
IDC_RCS_DEVELOP_HOOK_FORMULA                  = "Formula"
IDC_RCS_DEVELOP_HOOK_MATERIAL                 = "Material"
IDC_RCS_DEVELOP_HOOK_REBAR                    = "Rebar"
IDC_RCS_DEVELOP_HOOK_FACTOR                   = "Factor"
IDC_RCS_DEVELOP_HOOK_BAR                      = "main bar"
IDC_RCS_DEVELOP_HOOK_AS                       = "Use As Ratio"
IDC_RCS_DEVELOP_HOOK_AS_REQ                   = "As, req"
IDC_RCS_DEVELOP_HOOK_AS_USE                   = "As, use"

/////// IDD_RCS_SPLICING_TENS_DLG
IDC_RCS_SPLICING_TENS_FORMULA                 = "Formula"
IDC_RCS_SPLICING_TENS_GRADE                   = "Grade"
IDC_RCS_SPLICING_TENS_LDFRM                   = "Development Length"
IDC_RCS_SPLICING_TENS_LDTEXT                  = "ld, tension"

/////// IDD_RCS_SPLICING_COMP_DLG
IDC_RCS_SPLICING_COMP_FORMULA                 = "Formula"
IDC_RCS_SPLICING_COMP_MATERIAL                = "Material"
IDC_RCS_SPLICING_COMP_REBAR                   = "Rebar"
IDC_RCS_SPLICING_COMP_BAR                     = "main bar"

////// IDD_ERBE_PMODE_SECT2_DLG
IDC_GERBE_FRAME_CRACK                         = "Crack Control"
IDC_GURBE_LABEL_EXPOSURE_CLASS                = "Exposure Class"
IDC_GURBE_FRAME_CRACK_LIMIT                   = "Limit"
IDC_GURBE_FRAME_DEFLECTION                    = "Deflection"
IDC_GURBE_LABEL_DEFL_AMPLIFICATION            = "Amplification Factor"

///RcsDevSplDevCompACIDlg
IDC_RCS_DEVELOP_ACI_COMP_FORMULA              = "Formula"
IDC_RCS_DEVELOP_ACI_COMP_MATERIAL             = "Material Strength"
IDC_RCS_DEVELOP_ACI_COMP_REBAR                = "Rebar"
IDC_RCS_DEVELOP_ACI_COMP_FACTOR               = "Applicable Factor"
IDC_RCS_DEVELOP_ACI_COMP_AS                   = "Use As Ratio"

///RcsDevSplDevDetlACIDlg
IDC_RCS_DEVELOP_ACI_DETAIL_FORMULA            = "Formula"
IDC_RCS_DEVELOP_ACI_DETAIL_MATERIAL           = "Material Strength"
IDC_RCS_DEVELOP_ACI_DETAIL_REBAR              = "Rebar"
IDC_RCS_DEVELOP_ACI_DETAIL_FACTOR             = "Applicable Factor"
IDC_RCS_DEVELOP_ACI_DETAIL_AS                 = "Use As Ratio"

///RcsDevSplDevHookACIDlg
IDC_RCS_DEVELOP_ACI_HOOK_FORMULA              = "Formula"
IDC_RCS_DEVELOP_ACI_HOOK_MATERIAL             = "Material Strength"
IDC_RCS_DEVELOP_ACI_HOOK_REBAR                = "Rebar"
IDC_RCS_DEVELOP_ACI_HOOK_FACTOR               = "Applicable Factor"
IDC_RCS_DEVELOP_ACI_HOOK_AS                   = "Use As Ratio"
									          		  	
///RcsDevSplDevSimpACIDlg			          
IDC_RCS_DEVELOP_ACI_SIMPLE_FORMULA            = "Formula"
IDC_RCS_DEVELOP_ACI_SIMPLE_MATERIAL           = "Material Strength"
IDC_RCS_DEVELOP_ACI_SIMPLE_REBAR              = "Rebar"
IDC_RCS_DEVELOP_ACI_SIMPLE_FACTOR             = "Applicable Factor"
IDC_RCS_DEVELOP_ACI_SIMPLE_AS                 = "Use As Ratio"
									          		  	
///RcsDevSplSplCompACIDlg			          
IDC_RCS_SPLICING_ACI_COMP_FORMULA             = "Formula"
IDC_RCS_SPLICING_ACI_COMP_MATERIAL            = "Material Strength"
IDC_RCS_SPLICING_ACI_COMP_REBAR               = "Rebar"
IDC_RCS_SPLICING_ACI_COMP_LS_TENSION          = "ls, tension"
IDC_RCS_SPLICING_ACI_COMP_LS_SPLICE_LENGTH    = "Splice Length"
											  	
///RcsDevSplSplTensACIDlg
IDC_RCS_SPLICING_ACI_TENS_FORMULA             = "Formula"
IDC_RCS_SPLICING_ACI_TENS_MATERIAL            = "Material Strength"
IDC_RCS_SPLICING_ACI_TENS_REBAR               = "Rebar"
IDC_RCS_SPLICING_ACI_TENS_SPLICEGRADE         = "Splice Grade"
IDC_RCS_SPLICING_ACI_TENS_FACTOR              = "Applicable Factor"

///RcsAnchorBoltTabSectionDlg
IDC_GURAB_FRM_MATL       					  = "Material"
IDC_GURAB_LBL_CONC_MATL  					  = "Concrete"
IDC_GURAB_LBL_BOLT_MATL  					  = "Anchor Bolt"
IDC_GURAB_FRM_RC_SECTION 					  = "RC Section"
IDC_GURAB_RDO_RC_CRACK   					  = "Crack"
IDC_GURAB_RDO_RC_UNCRACK 					  = "Uncrack"
IDC_GURAB_CHK_RC_LEFT    					  = "Left"
IDC_GURAB_CHK_RC_RIGHT   					  = "Right"
IDC_GURAB_CHK_RC_TOP     					  = "Top"
IDC_GURAB_CHK_RC_BOT     					  = "Bottom"
IDC_GURAB_CHK_RC_THK     					  = "Thickness"
IDC_GURAB_CHK_RC_GROUT   					  = "Grout"

///RcsAnchorBoltTabAnchorDlg
IDC_GURAB_FRM_ANCHOR            			  = "Anchor"
IDC_GURAB_LBL_ANCHOR_INST_TYPE  			  = "Install Type"
IDC_GURAB_LBL_ANCHOR_BOLT_TYPE  			  = "Anchor Type"
IDC_GURAB_LBL_ANCHOR_DIAMETER   			  = "Diameter"
IDC_GURAB_LBL_ANCHOR_LENGTH     			  = "Length ( hef )"
IDC_GURAB_LBL_DIA_FOR_BEARING                 = "Diameter\nFor Bearing"
IDC_GURAB_LBL_ANCHOR_PULLOUT_NP 			  = "Pullout Strength ( Np )"
IDC_GURAB_LBL_ANCHOR_SPACE_EH   			  = "Dist. of J/L-Bolt ( eh )"
IDC_GURAB_LBL_ANCHOR_PULLOUT_N_NP 			  = "Pullout\nStrength ( Np )"
IDC_GURAB_LBL_ANCHOR_SPACE_N_EH   			  = "Distance of\nJ/L-Bolt ( eh )"
IDC_GURAB_FRM_STRENGTH_R_F      			  = "Strength Reduction Factor"
IDC_GURAB_LBL_STRENGTH_CONC_TENS			  = "Concrete, Tension"
IDC_GURAB_LBL_STRENGTH_CONC_SHEA			  = "Concrete, Shear"
IDC_GURAB_LBL_STRENGTH_ANCH_TENS			  = "Anchor, Tension"
IDC_GURAB_LBL_STRENGTH_ANCH_SHEA			  = "Anchor, Shear"
IDC_GURAB_FRM_DGN_FACT          			  = "Design"
IDC_GURAB_TABLE_LBL_DGN_FACT_KC       	      = "Breakout\nStrength\nCoefficient\n( kc )"
IDC_GURAB_LBL_DGN_FACT_KC       			  = "Breakout Strength Coefficient ( kc )"
IDC_GURAB_FRM_BOND_STRESS					  = "Bond Stress of Adhesive Anchor"

///RcsAnchorBoltTabForceDlg
IDC_GURAB_FRM_FORCE         				  = "Force"
IDC_GURAB_LBL_FORCE_AXIAL   				  = "Axial"
IDC_GURAB_LBL_FORCE_MOMENT_X				  = "Moment (x)"
IDC_GURAB_LBL_FORCE_MOMENT_Y				  = "Moment (y)"
IDC_GURAB_LBL_FORCE_SHEAR_X 				  = "Shear (x)"
IDC_GURAB_LBL_FORCE_SHEAR_Y 				  = "Shear (y)"
IDC_GURAB_LBL_FORCE_TORSION 				  = "Torsion"

///RcsAnchorBoltTabLayoutDlg
IDC_GURAB_LBL_LAYOUT_GRID_S_INT_X		      = "Space (Int. x)"
IDC_GURAB_LBL_LAYOUT_GRID_S_INT_Y		      = "Space (Int. y)"
IDC_GURAB_LBL_LAYOUT_GRID_S_EXT_X		      = "Space (Ext. x)"
IDC_GURAB_LBL_LAYOUT_GRID_S_EXT_Y		      = "Space (Ext. y)"
IDC_GURAB_LBL_LAYOUT_GRID_NUM_ROW		      = "Num. of Row"
IDC_GURAB_LBL_LAYOUT_GRID_NUM_COL		      = "Num. of Col"

IDC_GURAB_LBL_LAYOUT_COLM_WIDTH 			  = "Width"
IDC_GURAB_LBL_LAYOUT_COLM_HEIGHT			  = "Height"

///RcsAnchorBoltLayoutDlg
IDC_GURAB_FRM_LAYOUT_ANCHOR		     	      = "Layout of Anchor Bolt"

///RcsSoilLoadSeisDlg
IDC_LBL_SEIS_FACT                             = "Load Comb. Factor"
IDC_LBL_PARAM_IEE                             = "Importance Factor"
IDC_LBL_PARAM_RMF                             = "Response Mod. Factor"
IDC_LBL_PARAM_EGA                             = "Eff. Ground Acc."
IDC_LBL_GRND_CLAS                             = "Ground Class."
IDC_LBL_LEVL_BEDD                             = "Level of Bed Rock"
IDC_LBL_LEVL_1FLO                             = "1st FL Level"
IDC_LBL_LEVL_2LAY                             = "Level of 2nd Layer"
IDC_LBL_MAT_DEPTH                             = "Depth of Footing"
IDC_LBL_SOIL_PROP                             = "Soil Properties"
IDC_FIND_2ND_LAYER_LEVEL                      = "Find Level of 2nd Layer"

//IDD_ERCF_TAB1_DLG
IDC_GURCF_LIST_SHR_OFFSET_GRP				  = "Shear Offset Information"

//IDD_ERCF_TAB2_DLG
IDC_GURCF_LCOMB_GRP							  = "Load Combinations"
IDC_GURCF_SLS_LCOMB_CHK						  = "Apply SLS Load Combination"
IDC_GURCF_ULS_LCOMB_CHK						  = "Apply ULS Load Combination"
IDC_GURCF_FRAME_COLM						  = "Select Column"
IDC_GURCF_BTN_ADD							  = "Add"
IDC_GURCF_BTN_MOD							  = "Modify"
IDC_GURCF_BTN_DEL							  = "Delete"
IDC_GURCF_BTN_COLM_DATA						  = "Column Data..."
IDC_GURCF_COLM_SECT_SPAN_TEXT				  = "Span"
IDC_GURCF_LABEL_COLMPOS_TYPE				  = "Position"

/////// IDD_ERCF_COLM_DLG
IDD_ERCF_COLM_DLG							  = "Column Data"
IDC_GURCF_FRAME_COLMID                        = "Column ID"
IDC_GURCF_COLM_BTN_ADD						  = "Add"
IDC_GURCF_COLM_BTN_INS						  = "Insert"
IDC_GURCF_COLM_BTN_DEL						  = "Delete"
IDC_GURCF_COLM_BTN_OK						  = "OK"
IDC_GURCF_COLM_BTN_CANCEL					  = "Cancel"

/////// IDD_ERCF_MLIST_COLM_SUB_DLG
IDD_ERCF_MLIST_COLM_SUB_DLG					  = "Column Info."
IDC_GURCF_SEL_COLM_BTN_ALL                    = "All"
IDC_GURCF_SEL_COLM_BTN_NON                    = "None"
IDC_GURCF_SEL_COLM_BTN_INV                    = "Invert"
IDC_GURCF_FRM_MEMB_CUR                        = "Current Member"
IDC_GURCF_FRM_MEMB_SEL                        = "Select Member"

/////// IDD_ERCF_MLIST_REBAR_DLG
IDD_ERCF_MLIST_REBAR_DLG					  = "Rebar Info."

/////// IDD_ERCF_MLIST_SHEAR_OFFSET_DLG
IDD_ERCF_MLIST_SHEAR_OFFSET_DLG				  = "Shear Offset Info."

/////// IDD_RCS_URBB_PMODE_DLG
IDC_LBL_STRY_SLCT                             = "Select Story"
IDC_CHK_SHOW_FORC                             = "Show Design Force"
IDC_CHK_SHOW_RSLT                             = "Show Design Result"

/////// IDD_RCS_URBB_MEMB_DLG
IDC_CHK_MEMB_ONLY                             = "Member Only"
IDC_LBL_SORT_TYPE                             = "Sort by "
IDS_URBB_MEMB_NOT_SELECTED                    = "Member is not selected."

/////// IDD_RCS_URBC_PMODE_DLG
IDC_FRM_EDIT_MODE                             = "Edit Mode"
IDC_RCS_RADIO_EDIT_MEMB                       = "Member Data"
IDC_RCS_RADIO_EDIT_GRUP                       = "Section Group"
IDS_URBC_MEMB_NOT_SELECTED                    = "Member is not selected."

/////// IDD_RCS_GROUP_CTRL_DLG
IDC_LBL_SECT_GRUP                             = "Section Group"
IDC_BTN_GRUP_ASGN                             = "Assign"
IDC_BTN_GRUP_ADD                              = "Add" 
IDC_BTN_GRUP_DEL                              = "Delete" 
IDC_BTN_GRUP_CLEAR                            = "Clear Unused"
IDC_BTN_GRUP_AUTO                             = "Auto Grouping"
IDC_BTN_GRUP_SMT_DGN                          = "Smart Design" 
IDC_LBL_BLUE_TEXT                             = "※ Blue Text : Section group contains different input data in Section, Rebar and etc."

/////// IDD_URBB_SMART_DGN_DATA_DLG
IDC_CHK_MBAR_SAME                             = "Apply same rebar for each section"

/////// IDD_RCS_URGW_IMPORT_DLG
IDS_GET_DATA_FROM_RC_SHEAR_WALL               = "Get Data from RC Shear Wall"
IDS_SELECT_RC_SHEAR_WALL                      = "Select RC Shear Wall"
